/* automatically generated by rust-bindgen 0.59.1 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }
    #[inline]
    pub fn get(&self, bit_offset: usize, bit_width: u8) -> u64 {
        debug_assert!(bit_width <= 64);

            let index = if cfg!(target_endian = "big") {
                bit_width as usize - 1 - i
            } else {
                i
            };
            self.set_bit(index + bit_offset, val_bit_is_set);
        }
    }
}
pub type size_t = ::std::os::raw::c_ulong;
pub type va_list = __builtin_va_list;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __time_t = ::std::os::raw::c_long;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __intptr_t = ::std::os::raw::c_long;
pub type FILE = _IO_FILE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_marker {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_codecvt {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_wide_data {
    _unused: [u8; 0],
}
pub type _IO_lock_t = ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE {
    pub _flags: ::std::os::raw::c_int,
    pub _IO_read_ptr: *mut ::std::os::raw::c_char,
    pub _IO_read_end: *mut ::std::os::raw::c_char,
    pub _IO_read_base: *mut ::std::os::raw::c_char,
    pub _IO_write_base: *mut ::std::os::raw::c_char,
    pub _IO_write_ptr: *mut ::std::os::raw::c_char,
    pub _IO_write_end: *mut ::std::os::raw::c_char,
    pub _IO_buf_base: *mut ::std::os::raw::c_char,
    pub _IO_buf_end: *mut ::std::os::raw::c_char,
    pub _IO_save_base: *mut ::std::os::raw::c_char,
    pub _IO_backup_base: *mut ::std::os::raw::c_char,
    pub _IO_save_end: *mut ::std::os::raw::c_char,
    pub _markers: *mut _IO_marker,
    pub _chain: *mut _IO_FILE,
    pub _fileno: ::std::os::raw::c_int,
    pub _flags2: ::std::os::raw::c_int,
    pub _old_offset: __off_t,
    pub _cur_column: ::std::os::raw::c_ushort,
    pub _vtable_offset: ::std::os::raw::c_schar,
    pub _shortbuf: [::std::os::raw::c_char; 1usize],
    pub _lock: *mut _IO_lock_t,
    pub _offset: __off64_t,
    pub _codecvt: *mut _IO_codecvt,
    pub _wide_data: *mut _IO_wide_data,
    pub _freeres_list: *mut _IO_FILE,
    pub _freeres_buf: *mut ::std::os::raw::c_void,
    pub __pad5: size_t,
    pub _mode: ::std::os::raw::c_int,
    pub _unused2: [::std::os::raw::c_char; 20usize],
}
#[test]
fn bindgen_test_layout__IO_FILE() {
    assert_eq!(
        ::std::mem::size_of::<_IO_FILE>(),
        216usize,
        concat!("Size of: ", stringify!(_IO_FILE))
    );
    assert_eq!(
        ::std::mem::align_of::<_IO_FILE>(),
        8usize,
        concat!("Alignment of ", stringify!(_IO_FILE))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._flags as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_read_ptr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_ptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_read_end as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_read_base as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_write_base as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_write_ptr as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_ptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_write_end as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_buf_base as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_buf_end as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_save_base as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_backup_base as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_backup_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_save_end as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._markers as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_markers)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._chain as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_chain)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._fileno as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_fileno)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._flags2 as *const _ as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._old_offset as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_old_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._cur_column as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_cur_column)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._vtable_offset as *const _ as usize },
        130usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_vtable_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._shortbuf as *const _ as usize },
        131usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_shortbuf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._lock as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_lock)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._offset as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._codecvt as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_codecvt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._wide_data as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_wide_data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._freeres_list as *const _ as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_freeres_list)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._freeres_buf as *const _ as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_freeres_buf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>())).__pad5 as *const _ as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad5)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._mode as *const _ as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._unused2 as *const _ as usize },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_unused2)
        )
    );
}
pub type ssize_t = __ssize_t;
pub type wchar_t = ::std::os::raw::c_int;
pub type time_t = __time_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
#[test]
fn bindgen_test_layout_timeval() {
    assert_eq!(
        ::std::mem::size_of::<timeval>(),
        16usize,
        concat!("Size of: ", stringify!(timeval))
    );
    assert_eq!(
        ::std::mem::align_of::<timeval>(),
        8usize,
        concat!("Alignment of ", stringify!(timeval))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timeval>())).tv_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timeval>())).tv_usec as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_usec)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[test]
fn bindgen_test_layout_timespec() {
    assert_eq!(
        ::std::mem::size_of::<timespec>(),
        16usize,
        concat!("Size of: ", stringify!(timespec))
    );
    assert_eq!(
        ::std::mem::align_of::<timespec>(),
        8usize,
        concat!("Alignment of ", stringify!(timespec))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timespec>())).tv_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timespec>())).tv_nsec as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_nsec)
        )
    );
}
pub type pthread_key_t = ::std::os::raw::c_uint;
pub type Py_uintptr_t = usize;
pub type Py_intptr_t = isize;
pub type Py_ssize_t = ssize_t;
pub type Py_hash_t = Py_ssize_t;
pub type Py_uhash_t = size_t;
pub type Py_ssize_clean_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm {
    pub tm_sec: ::std::os::raw::c_int,
    pub tm_min: ::std::os::raw::c_int,
    pub tm_hour: ::std::os::raw::c_int,
    pub tm_mday: ::std::os::raw::c_int,
    pub tm_mon: ::std::os::raw::c_int,
    pub tm_year: ::std::os::raw::c_int,
    pub tm_wday: ::std::os::raw::c_int,
    pub tm_yday: ::std::os::raw::c_int,
    pub tm_isdst: ::std::os::raw::c_int,
    pub tm_gmtoff: ::std::os::raw::c_long,
    pub tm_zone: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_tm() {
    assert_eq!(
        ::std::mem::size_of::<tm>(),
        56usize,
        concat!("Size of: ", stringify!(tm))
    );
    assert_eq!(
        ::std::mem::align_of::<tm>(),
        8usize,
        concat!("Alignment of ", stringify!(tm))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_min as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_min)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_hour as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_hour)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_mday as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_mday)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_mon as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_mon)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_year as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_year)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_wday as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_wday)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_yday as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_yday)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_isdst as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_isdst)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_gmtoff as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_gmtoff)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_zone as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_zone)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stat {
    pub st_dev: __dev_t,
    pub st_ino: __ino_t,
    pub st_nlink: __nlink_t,
    pub st_mode: __mode_t,
    pub st_uid: __uid_t,
    pub st_gid: __gid_t,
    pub __pad0: ::std::os::raw::c_int,
    pub st_rdev: __dev_t,
    pub st_size: __off_t,
    pub st_blksize: __blksize_t,
    pub st_blocks: __blkcnt_t,
    pub st_atim: timespec,
    pub st_mtim: timespec,
    pub st_ctim: timespec,
    pub __glibc_reserved: [__syscall_slong_t; 3usize],
}
#[test]
fn bindgen_test_layout_stat() {
    assert_eq!(
        ::std::mem::size_of::<stat>(),
        144usize,
        concat!("Size of: ", stringify!(stat))
    );
    assert_eq!(
        ::std::mem::align_of::<stat>(),
        8usize,
        concat!("Alignment of ", stringify!(stat))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<stat>())).st_dev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_dev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<stat>())).st_ino as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_ino)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<stat>())).st_nlink as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_nlink)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<stat>())).st_mode as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<stat>())).st_uid as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_uid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<stat>())).st_gid as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_gid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<stat>())).__pad0 as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(__pad0)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<stat>())).st_rdev as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_rdev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<stat>())).st_size as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<stat>())).st_blksize as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_blksize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<stat>())).st_blocks as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_blocks)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<stat>())).st_atim as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_atim)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<stat>())).st_mtim as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_mtim)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<stat>())).st_ctim as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_ctim)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<stat>())).__glibc_reserved as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(__glibc_reserved)
        )
    );
}
pub type PyTypeObject = _typeobject;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _object {
    pub ob_refcnt: Py_ssize_t,
    pub ob_type: *mut PyTypeObject,
}
#[test]
fn bindgen_test_layout__object() {
    assert_eq!(
        ::std::mem::size_of::<_object>(),
        16usize,
        concat!("Size of: ", stringify!(_object))
    );
    assert_eq!(
        ::std::mem::align_of::<_object>(),
        8usize,
        concat!("Alignment of ", stringify!(_object))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_object>())).ob_refcnt as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_object),
            "::",
            stringify!(ob_refcnt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_object>())).ob_type as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_object),
            "::",
            stringify!(ob_type)
        )
    );
}
pub type PyObject = _object;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PyVarObject {
    pub ob_base: PyObject,
    pub ob_size: Py_ssize_t,
}
#[test]
fn bindgen_test_layout_PyVarObject() {
    assert_eq!(
        ::std::mem::size_of::<PyVarObject>(),
        24usize,
        concat!("Size of: ", stringify!(PyVarObject))
    );
    assert_eq!(
        ::std::mem::align_of::<PyVarObject>(),
        8usize,
        concat!("Alignment of ", stringify!(PyVarObject))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyVarObject>())).ob_base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PyVarObject),
            "::",
            stringify!(ob_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyVarObject>())).ob_size as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(PyVarObject),
            "::",
            stringify!(ob_size)
        )
    );
}
pub type unaryfunc =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut PyObject) -> *mut PyObject>;
pub type binaryfunc = ::std::option::Option<
    unsafe extern "C" fn(arg1: *mut PyObject, arg2: *mut PyObject) -> *mut PyObject,
>;
pub type ternaryfunc = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut PyObject,
        arg2: *mut PyObject,
        arg3: *mut PyObject,
    ) -> *mut PyObject,
>;
pub type inquiry =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut PyObject) -> ::std::os::raw::c_int>;
pub type lenfunc = ::std::option::Option<unsafe extern "C" fn(arg1: *mut PyObject) -> Py_ssize_t>;
pub type ssizeargfunc = ::std::option::Option<
    unsafe extern "C" fn(arg1: *mut PyObject, arg2: Py_ssize_t) -> *mut PyObject,
>;
pub type ssizeobjargproc = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut PyObject,
        arg2: Py_ssize_t,
        arg3: *mut PyObject,
    ) -> ::std::os::raw::c_int,
>;
pub type objobjargproc = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut PyObject,
        arg2: *mut PyObject,
        arg3: *mut PyObject,
    ) -> ::std::os::raw::c_int,
>;
pub type objobjproc = ::std::option::Option<
    unsafe extern "C" fn(arg1: *mut PyObject, arg2: *mut PyObject) -> ::std::os::raw::c_int,
>;
pub type visitproc = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut PyObject,
        arg2: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type traverseproc = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut PyObject,
        arg2: visitproc,
        arg3: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type freefunc = ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>;
pub type destructor = ::std::option::Option<unsafe extern "C" fn(arg1: *mut PyObject)>;
pub type getattrfunc = ::std::option::Option<
    unsafe extern "C" fn(arg1: *mut PyObject, arg2: *mut ::std::os::raw::c_char) -> *mut PyObject,
>;
pub type getattrofunc = ::std::option::Option<
    unsafe extern "C" fn(arg1: *mut PyObject, arg2: *mut PyObject) -> *mut PyObject,
>;
pub type setattrfunc = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut PyObject,
        arg2: *mut ::std::os::raw::c_char,
        arg3: *mut PyObject,
    ) -> ::std::os::raw::c_int,
>;
pub type setattrofunc = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut PyObject,
        arg2: *mut PyObject,
        arg3: *mut PyObject,
    ) -> ::std::os::raw::c_int,
>;
pub type reprfunc =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut PyObject) -> *mut PyObject>;
pub type hashfunc = ::std::option::Option<unsafe extern "C" fn(arg1: *mut PyObject) -> Py_hash_t>;
pub type richcmpfunc = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut PyObject,
        arg2: *mut PyObject,
        arg3: ::std::os::raw::c_int,
    ) -> *mut PyObject,
>;
pub type getiterfunc =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut PyObject) -> *mut PyObject>;
pub type iternextfunc =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut PyObject) -> *mut PyObject>;
pub type descrgetfunc = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut PyObject,
        arg2: *mut PyObject,
        arg3: *mut PyObject,
    ) -> *mut PyObject,
>;
pub type descrsetfunc = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut PyObject,
        arg2: *mut PyObject,
        arg3: *mut PyObject,
    ) -> ::std::os::raw::c_int,
>;
pub type initproc = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut PyObject,
        arg2: *mut PyObject,
        arg3: *mut PyObject,
    ) -> ::std::os::raw::c_int,
>;
pub type newfunc = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut PyTypeObject,
        arg2: *mut PyObject,
        arg3: *mut PyObject,
    ) -> *mut PyObject,
>;
pub type allocfunc = ::std::option::Option<
    unsafe extern "C" fn(arg1: *mut PyTypeObject, arg2: Py_ssize_t) -> *mut PyObject,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PyType_Slot {
    pub slot: ::std::os::raw::c_int,
    pub pfunc: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_PyType_Slot() {
    assert_eq!(
        ::std::mem::size_of::<PyType_Slot>(),
        16usize,
        concat!("Size of: ", stringify!(PyType_Slot))
    );
    assert_eq!(
        ::std::mem::align_of::<PyType_Slot>(),
        8usize,
        concat!("Alignment of ", stringify!(PyType_Slot))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyType_Slot>())).slot as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PyType_Slot),
            "::",
            stringify!(slot)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyType_Slot>())).pfunc as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(PyType_Slot),
            "::",
            stringify!(pfunc)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PyType_Spec {
    pub name: *const ::std::os::raw::c_char,
    pub basicsize: ::std::os::raw::c_int,
    pub itemsize: ::std::os::raw::c_int,
    pub flags: ::std::os::raw::c_uint,
    pub slots: *mut PyType_Slot,
}
#[test]
fn bindgen_test_layout_PyType_Spec() {
    assert_eq!(
        ::std::mem::size_of::<PyType_Spec>(),
        32usize,
        concat!("Size of: ", stringify!(PyType_Spec))
    );
    assert_eq!(
        ::std::mem::align_of::<PyType_Spec>(),
        8usize,
        concat!("Alignment of ", stringify!(PyType_Spec))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyType_Spec>())).name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PyType_Spec),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyType_Spec>())).basicsize as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(PyType_Spec),
            "::",
            stringify!(basicsize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyType_Spec>())).itemsize as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(PyType_Spec),
            "::",
            stringify!(itemsize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyType_Spec>())).flags as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(PyType_Spec),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyType_Spec>())).slots as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(PyType_Spec),
            "::",
            stringify!(slots)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _Py_Identifier {
    pub next: *mut _Py_Identifier,
    pub string: *const ::std::os::raw::c_char,
    pub object: *mut PyObject,
}
#[test]
fn bindgen_test_layout__Py_Identifier() {
    assert_eq!(
        ::std::mem::size_of::<_Py_Identifier>(),
        24usize,
        concat!("Size of: ", stringify!(_Py_Identifier))
    );
    assert_eq!(
        ::std::mem::align_of::<_Py_Identifier>(),
        8usize,
        concat!("Alignment of ", stringify!(_Py_Identifier))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_Py_Identifier>())).next as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_Py_Identifier),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_Py_Identifier>())).string as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_Py_Identifier),
            "::",
            stringify!(string)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_Py_Identifier>())).object as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_Py_Identifier),
            "::",
            stringify!(object)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bufferinfo {
    pub buf: *mut ::std::os::raw::c_void,
    pub obj: *mut PyObject,
    pub len: Py_ssize_t,
    pub itemsize: Py_ssize_t,
    pub readonly: ::std::os::raw::c_int,
    pub ndim: ::std::os::raw::c_int,
    pub format: *mut ::std::os::raw::c_char,
    pub shape: *mut Py_ssize_t,
    pub strides: *mut Py_ssize_t,
    pub suboffsets: *mut Py_ssize_t,
    pub internal: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_bufferinfo() {
    assert_eq!(
        ::std::mem::size_of::<bufferinfo>(),
        80usize,
        concat!("Size of: ", stringify!(bufferinfo))
    );
    assert_eq!(
        ::std::mem::align_of::<bufferinfo>(),
        8usize,
        concat!("Alignment of ", stringify!(bufferinfo))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bufferinfo>())).buf as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bufferinfo),
            "::",
            stringify!(buf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bufferinfo>())).obj as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(bufferinfo),
            "::",
            stringify!(obj)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bufferinfo>())).len as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(bufferinfo),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bufferinfo>())).itemsize as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(bufferinfo),
            "::",
            stringify!(itemsize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bufferinfo>())).readonly as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(bufferinfo),
            "::",
            stringify!(readonly)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bufferinfo>())).ndim as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(bufferinfo),
            "::",
            stringify!(ndim)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bufferinfo>())).format as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(bufferinfo),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bufferinfo>())).shape as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(bufferinfo),
            "::",
            stringify!(shape)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bufferinfo>())).strides as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(bufferinfo),
            "::",
            stringify!(strides)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bufferinfo>())).suboffsets as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(bufferinfo),
            "::",
            stringify!(suboffsets)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bufferinfo>())).internal as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(bufferinfo),
            "::",
            stringify!(internal)
        )
    );
}
pub type Py_buffer = bufferinfo;
pub type getbufferproc = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut PyObject,
        arg2: *mut Py_buffer,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type releasebufferproc =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut PyObject, arg2: *mut Py_buffer)>;
pub type vectorcallfunc = ::std::option::Option<
    unsafe extern "C" fn(
        callable: *mut PyObject,
        args: *const *mut PyObject,
        nargsf: size_t,
        kwnames: *mut PyObject,
    ) -> *mut PyObject,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PyNumberMethods {
    pub nb_add: binaryfunc,
    pub nb_subtract: binaryfunc,
    pub nb_multiply: binaryfunc,
    pub nb_remainder: binaryfunc,
    pub nb_divmod: binaryfunc,
    pub nb_power: ternaryfunc,
    pub nb_negative: unaryfunc,
    pub nb_positive: unaryfunc,
    pub nb_absolute: unaryfunc,
    pub nb_bool: inquiry,
    pub nb_invert: unaryfunc,
    pub nb_lshift: binaryfunc,
    pub nb_rshift: binaryfunc,
    pub nb_and: binaryfunc,
    pub nb_xor: binaryfunc,
    pub nb_or: binaryfunc,
    pub nb_int: unaryfunc,
    pub nb_reserved: *mut ::std::os::raw::c_void,
    pub nb_float: unaryfunc,
    pub nb_inplace_add: binaryfunc,
    pub nb_inplace_subtract: binaryfunc,
    pub nb_inplace_multiply: binaryfunc,
    pub nb_inplace_remainder: binaryfunc,
    pub nb_inplace_power: ternaryfunc,
    pub nb_inplace_lshift: binaryfunc,
    pub nb_inplace_rshift: binaryfunc,
    pub nb_inplace_and: binaryfunc,
    pub nb_inplace_xor: binaryfunc,
    pub nb_inplace_or: binaryfunc,
    pub nb_floor_divide: binaryfunc,
    pub nb_true_divide: binaryfunc,
    pub nb_inplace_floor_divide: binaryfunc,
    pub nb_inplace_true_divide: binaryfunc,
    pub nb_index: unaryfunc,
    pub nb_matrix_multiply: binaryfunc,
    pub nb_inplace_matrix_multiply: binaryfunc,
}
#[test]
fn bindgen_test_layout_PyNumberMethods() {
    assert_eq!(
        ::std::mem::size_of::<PyNumberMethods>(),
        288usize,
        concat!("Size of: ", stringify!(PyNumberMethods))
    );
    assert_eq!(
        ::std::mem::align_of::<PyNumberMethods>(),
        8usize,
        concat!("Alignment of ", stringify!(PyNumberMethods))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyNumberMethods>())).nb_add as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PyNumberMethods),
            "::",
            stringify!(nb_add)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyNumberMethods>())).nb_subtract as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(PyNumberMethods),
            "::",
            stringify!(nb_subtract)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyNumberMethods>())).nb_multiply as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(PyNumberMethods),
            "::",
            stringify!(nb_multiply)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyNumberMethods>())).nb_remainder as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(PyNumberMethods),
            "::",
            stringify!(nb_remainder)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyNumberMethods>())).nb_divmod as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(PyNumberMethods),
            "::",
            stringify!(nb_divmod)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyNumberMethods>())).nb_power as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(PyNumberMethods),
            "::",
            stringify!(nb_power)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyNumberMethods>())).nb_negative as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(PyNumberMethods),
            "::",
            stringify!(nb_negative)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyNumberMethods>())).nb_positive as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(PyNumberMethods),
            "::",
            stringify!(nb_positive)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyNumberMethods>())).nb_absolute as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(PyNumberMethods),
            "::",
            stringify!(nb_absolute)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyNumberMethods>())).nb_bool as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(PyNumberMethods),
            "::",
            stringify!(nb_bool)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyNumberMethods>())).nb_invert as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(PyNumberMethods),
            "::",
            stringify!(nb_invert)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyNumberMethods>())).nb_lshift as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(PyNumberMethods),
            "::",
            stringify!(nb_lshift)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyNumberMethods>())).nb_rshift as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(PyNumberMethods),
            "::",
            stringify!(nb_rshift)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyNumberMethods>())).nb_and as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(PyNumberMethods),
            "::",
            stringify!(nb_and)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyNumberMethods>())).nb_xor as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(PyNumberMethods),
            "::",
            stringify!(nb_xor)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyNumberMethods>())).nb_or as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(PyNumberMethods),
            "::",
            stringify!(nb_or)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyNumberMethods>())).nb_int as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(PyNumberMethods),
            "::",
            stringify!(nb_int)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyNumberMethods>())).nb_reserved as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(PyNumberMethods),
            "::",
            stringify!(nb_reserved)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyNumberMethods>())).nb_float as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(PyNumberMethods),
            "::",
            stringify!(nb_float)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyNumberMethods>())).nb_inplace_add as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(PyNumberMethods),
            "::",
            stringify!(nb_inplace_add)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<PyNumberMethods>())).nb_inplace_subtract as *const _ as usize
        },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(PyNumberMethods),
            "::",
            stringify!(nb_inplace_subtract)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<PyNumberMethods>())).nb_inplace_multiply as *const _ as usize
        },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(PyNumberMethods),
            "::",
            stringify!(nb_inplace_multiply)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<PyNumberMethods>())).nb_inplace_remainder as *const _ as usize
        },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(PyNumberMethods),
            "::",
            stringify!(nb_inplace_remainder)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<PyNumberMethods>())).nb_inplace_power as *const _ as usize
        },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(PyNumberMethods),
            "::",
            stringify!(nb_inplace_power)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<PyNumberMethods>())).nb_inplace_lshift as *const _ as usize
        },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(PyNumberMethods),
            "::",
            stringify!(nb_inplace_lshift)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<PyNumberMethods>())).nb_inplace_rshift as *const _ as usize
        },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(PyNumberMethods),
            "::",
            stringify!(nb_inplace_rshift)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyNumberMethods>())).nb_inplace_and as *const _ as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(PyNumberMethods),
            "::",
            stringify!(nb_inplace_and)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyNumberMethods>())).nb_inplace_xor as *const _ as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(PyNumberMethods),
            "::",
            stringify!(nb_inplace_xor)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyNumberMethods>())).nb_inplace_or as *const _ as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(PyNumberMethods),
            "::",
            stringify!(nb_inplace_or)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyNumberMethods>())).nb_floor_divide as *const _ as usize },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(PyNumberMethods),
            "::",
            stringify!(nb_floor_divide)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyNumberMethods>())).nb_true_divide as *const _ as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(PyNumberMethods),
            "::",
            stringify!(nb_true_divide)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<PyNumberMethods>())).nb_inplace_floor_divide as *const _ as usize
        },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(PyNumberMethods),
            "::",
            stringify!(nb_inplace_floor_divide)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<PyNumberMethods>())).nb_inplace_true_divide as *const _ as usize
        },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(PyNumberMethods),
            "::",
            stringify!(nb_inplace_true_divide)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyNumberMethods>())).nb_index as *const _ as usize },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(PyNumberMethods),
            "::",
            stringify!(nb_index)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<PyNumberMethods>())).nb_matrix_multiply as *const _ as usize
        },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(PyNumberMethods),
            "::",
            stringify!(nb_matrix_multiply)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<PyNumberMethods>())).nb_inplace_matrix_multiply as *const _
                as usize
        },
        280usize,
        concat!(
            "Offset of field: ",
            stringify!(PyNumberMethods),
            "::",
            stringify!(nb_inplace_matrix_multiply)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PySequenceMethods {
    pub sq_length: lenfunc,
    pub sq_concat: binaryfunc,
    pub sq_repeat: ssizeargfunc,
    pub sq_item: ssizeargfunc,
    pub was_sq_slice: *mut ::std::os::raw::c_void,
    pub sq_ass_item: ssizeobjargproc,
    pub was_sq_ass_slice: *mut ::std::os::raw::c_void,
    pub sq_contains: objobjproc,
    pub sq_inplace_concat: binaryfunc,
    pub sq_inplace_repeat: ssizeargfunc,
}
#[test]
fn bindgen_test_layout_PySequenceMethods() {
    assert_eq!(
        ::std::mem::size_of::<PySequenceMethods>(),
        80usize,
        concat!("Size of: ", stringify!(PySequenceMethods))
    );
    assert_eq!(
        ::std::mem::align_of::<PySequenceMethods>(),
        8usize,
        concat!("Alignment of ", stringify!(PySequenceMethods))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PySequenceMethods>())).sq_length as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PySequenceMethods),
            "::",
            stringify!(sq_length)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PySequenceMethods>())).sq_concat as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(PySequenceMethods),
            "::",
            stringify!(sq_concat)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PySequenceMethods>())).sq_repeat as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(PySequenceMethods),
            "::",
            stringify!(sq_repeat)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PySequenceMethods>())).sq_item as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(PySequenceMethods),
            "::",
            stringify!(sq_item)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PySequenceMethods>())).was_sq_slice as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(PySequenceMethods),
            "::",
            stringify!(was_sq_slice)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PySequenceMethods>())).sq_ass_item as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(PySequenceMethods),
            "::",
            stringify!(sq_ass_item)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<PySequenceMethods>())).was_sq_ass_slice as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(PySequenceMethods),
            "::",
            stringify!(was_sq_ass_slice)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PySequenceMethods>())).sq_contains as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(PySequenceMethods),
            "::",
            stringify!(sq_contains)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<PySequenceMethods>())).sq_inplace_concat as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(PySequenceMethods),
            "::",
            stringify!(sq_inplace_concat)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<PySequenceMethods>())).sq_inplace_repeat as *const _ as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(PySequenceMethods),
            "::",
            stringify!(sq_inplace_repeat)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PyMappingMethods {
    pub mp_length: lenfunc,
    pub mp_subscript: binaryfunc,
    pub mp_ass_subscript: objobjargproc,
}
#[test]
fn bindgen_test_layout_PyMappingMethods() {
    assert_eq!(
        ::std::mem::size_of::<PyMappingMethods>(),
        24usize,
        concat!("Size of: ", stringify!(PyMappingMethods))
    );
    assert_eq!(
        ::std::mem::align_of::<PyMappingMethods>(),
        8usize,
        concat!("Alignment of ", stringify!(PyMappingMethods))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyMappingMethods>())).mp_length as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PyMappingMethods),
            "::",
            stringify!(mp_length)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyMappingMethods>())).mp_subscript as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(PyMappingMethods),
            "::",
            stringify!(mp_subscript)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<PyMappingMethods>())).mp_ass_subscript as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(PyMappingMethods),
            "::",
            stringify!(mp_ass_subscript)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PyAsyncMethods {
    pub am_await: unaryfunc,
    pub am_aiter: unaryfunc,
    pub am_anext: unaryfunc,
}
#[test]
fn bindgen_test_layout_PyAsyncMethods() {
    assert_eq!(
        ::std::mem::size_of::<PyAsyncMethods>(),
        24usize,
        concat!("Size of: ", stringify!(PyAsyncMethods))
    );
    assert_eq!(
        ::std::mem::align_of::<PyAsyncMethods>(),
        8usize,
        concat!("Alignment of ", stringify!(PyAsyncMethods))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyAsyncMethods>())).am_await as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PyAsyncMethods),
            "::",
            stringify!(am_await)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyAsyncMethods>())).am_aiter as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(PyAsyncMethods),
            "::",
            stringify!(am_aiter)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyAsyncMethods>())).am_anext as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(PyAsyncMethods),
            "::",
            stringify!(am_anext)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PyBufferProcs {
    pub bf_getbuffer: getbufferproc,
    pub bf_releasebuffer: releasebufferproc,
}
#[test]
fn bindgen_test_layout_PyBufferProcs() {
    assert_eq!(
        ::std::mem::size_of::<PyBufferProcs>(),
        16usize,
        concat!("Size of: ", stringify!(PyBufferProcs))
    );
    assert_eq!(
        ::std::mem::align_of::<PyBufferProcs>(),
        8usize,
        concat!("Alignment of ", stringify!(PyBufferProcs))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyBufferProcs>())).bf_getbuffer as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PyBufferProcs),
            "::",
            stringify!(bf_getbuffer)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyBufferProcs>())).bf_releasebuffer as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(PyBufferProcs),
            "::",
            stringify!(bf_releasebuffer)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _typeobject {
    pub ob_base: PyVarObject,
    pub tp_name: *const ::std::os::raw::c_char,
    pub tp_basicsize: Py_ssize_t,
    pub tp_itemsize: Py_ssize_t,
    pub tp_dealloc: destructor,
    pub tp_vectorcall_offset: Py_ssize_t,
    pub tp_getattr: getattrfunc,
    pub tp_setattr: setattrfunc,
    pub tp_as_async: *mut PyAsyncMethods,
    pub tp_repr: reprfunc,
    pub tp_as_number: *mut PyNumberMethods,
    pub tp_as_sequence: *mut PySequenceMethods,
    pub tp_as_mapping: *mut PyMappingMethods,
    pub tp_hash: hashfunc,
    pub tp_call: ternaryfunc,
    pub tp_str: reprfunc,
    pub tp_getattro: getattrofunc,
    pub tp_setattro: setattrofunc,
    pub tp_as_buffer: *mut PyBufferProcs,
    pub tp_flags: ::std::os::raw::c_ulong,
    pub tp_doc: *const ::std::os::raw::c_char,
    pub tp_traverse: traverseproc,
    pub tp_clear: inquiry,
    pub tp_richcompare: richcmpfunc,
    pub tp_weaklistoffset: Py_ssize_t,
    pub tp_iter: getiterfunc,
    pub tp_iternext: iternextfunc,
    pub tp_methods: *mut PyMethodDef,
    pub tp_members: *mut PyMemberDef,
    pub tp_getset: *mut PyGetSetDef,
    pub tp_base: *mut _typeobject,
    pub tp_dict: *mut PyObject,
    pub tp_descr_get: descrgetfunc,
    pub tp_descr_set: descrsetfunc,
    pub tp_dictoffset: Py_ssize_t,
    pub tp_init: initproc,
    pub tp_alloc: allocfunc,
    pub tp_new: newfunc,
    pub tp_free: freefunc,
    pub tp_is_gc: inquiry,
    pub tp_bases: *mut PyObject,
    pub tp_mro: *mut PyObject,
    pub tp_cache: *mut PyObject,
    pub tp_subclasses: *mut PyObject,
    pub tp_weaklist: *mut PyObject,
    pub tp_del: destructor,
    pub tp_version_tag: ::std::os::raw::c_uint,
    pub tp_finalize: destructor,
    pub tp_vectorcall: vectorcallfunc,
}
#[test]
fn bindgen_test_layout__typeobject() {
    assert_eq!(
        ::std::mem::size_of::<_typeobject>(),
        408usize,
        concat!("Size of: ", stringify!(_typeobject))
    );
    assert_eq!(
        ::std::mem::align_of::<_typeobject>(),
        8usize,
        concat!("Alignment of ", stringify!(_typeobject))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_typeobject>())).ob_base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_typeobject),
            "::",
            stringify!(ob_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_typeobject>())).tp_name as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_typeobject),
            "::",
            stringify!(tp_name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_typeobject>())).tp_basicsize as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_typeobject),
            "::",
            stringify!(tp_basicsize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_typeobject>())).tp_itemsize as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_typeobject),
            "::",
            stringify!(tp_itemsize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_typeobject>())).tp_dealloc as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_typeobject),
            "::",
            stringify!(tp_dealloc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_typeobject>())).tp_vectorcall_offset as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_typeobject),
            "::",
            stringify!(tp_vectorcall_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_typeobject>())).tp_getattr as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_typeobject),
            "::",
            stringify!(tp_getattr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_typeobject>())).tp_setattr as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_typeobject),
            "::",
            stringify!(tp_setattr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_typeobject>())).tp_as_async as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_typeobject),
            "::",
            stringify!(tp_as_async)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_typeobject>())).tp_repr as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_typeobject),
            "::",
            stringify!(tp_repr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_typeobject>())).tp_as_number as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_typeobject),
            "::",
            stringify!(tp_as_number)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_typeobject>())).tp_as_sequence as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_typeobject),
            "::",
            stringify!(tp_as_sequence)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_typeobject>())).tp_as_mapping as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_typeobject),
            "::",
            stringify!(tp_as_mapping)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_typeobject>())).tp_hash as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_typeobject),
            "::",
            stringify!(tp_hash)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_typeobject>())).tp_call as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_typeobject),
            "::",
            stringify!(tp_call)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_typeobject>())).tp_str as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(_typeobject),
            "::",
            stringify!(tp_str)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_typeobject>())).tp_getattro as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(_typeobject),
            "::",
            stringify!(tp_getattro)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_typeobject>())).tp_setattro as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(_typeobject),
            "::",
            stringify!(tp_setattro)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_typeobject>())).tp_as_buffer as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(_typeobject),
            "::",
            stringify!(tp_as_buffer)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_typeobject>())).tp_flags as *const _ as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(_typeobject),
            "::",
            stringify!(tp_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_typeobject>())).tp_doc as *const _ as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(_typeobject),
            "::",
            stringify!(tp_doc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_typeobject>())).tp_traverse as *const _ as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(_typeobject),
            "::",
            stringify!(tp_traverse)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_typeobject>())).tp_clear as *const _ as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(_typeobject),
            "::",
            stringify!(tp_clear)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_typeobject>())).tp_richcompare as *const _ as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(_typeobject),
            "::",
            stringify!(tp_richcompare)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_typeobject>())).tp_weaklistoffset as *const _ as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(_typeobject),
            "::",
            stringify!(tp_weaklistoffset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_typeobject>())).tp_iter as *const _ as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(_typeobject),
            "::",
            stringify!(tp_iter)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_typeobject>())).tp_iternext as *const _ as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(_typeobject),
            "::",
            stringify!(tp_iternext)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_typeobject>())).tp_methods as *const _ as usize },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(_typeobject),
            "::",
            stringify!(tp_methods)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_typeobject>())).tp_members as *const _ as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(_typeobject),
            "::",
            stringify!(tp_members)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_typeobject>())).tp_getset as *const _ as usize },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(_typeobject),
            "::",
            stringify!(tp_getset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_typeobject>())).tp_base as *const _ as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(_typeobject),
            "::",
            stringify!(tp_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_typeobject>())).tp_dict as *const _ as usize },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(_typeobject),
            "::",
            stringify!(tp_dict)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_typeobject>())).tp_descr_get as *const _ as usize },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(_typeobject),
            "::",
            stringify!(tp_descr_get)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_typeobject>())).tp_descr_set as *const _ as usize },
        280usize,
        concat!(
            "Offset of field: ",
            stringify!(_typeobject),
            "::",
            stringify!(tp_descr_set)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_typeobject>())).tp_dictoffset as *const _ as usize },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(_typeobject),
            "::",
            stringify!(tp_dictoffset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_typeobject>())).tp_init as *const _ as usize },
        296usize,
        concat!(
            "Offset of field: ",
            stringify!(_typeobject),
            "::",
            stringify!(tp_init)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_typeobject>())).tp_alloc as *const _ as usize },
        304usize,
        concat!(
            "Offset of field: ",
            stringify!(_typeobject),
            "::",
            stringify!(tp_alloc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_typeobject>())).tp_new as *const _ as usize },
        312usize,
        concat!(
            "Offset of field: ",
            stringify!(_typeobject),
            "::",
            stringify!(tp_new)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_typeobject>())).tp_free as *const _ as usize },
        320usize,
        concat!(
            "Offset of field: ",
            stringify!(_typeobject),
            "::",
            stringify!(tp_free)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_typeobject>())).tp_is_gc as *const _ as usize },
        328usize,
        concat!(
            "Offset of field: ",
            stringify!(_typeobject),
            "::",
            stringify!(tp_is_gc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_typeobject>())).tp_bases as *const _ as usize },
        336usize,
        concat!(
            "Offset of field: ",
            stringify!(_typeobject),
            "::",
            stringify!(tp_bases)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_typeobject>())).tp_mro as *const _ as usize },
        344usize,
        concat!(
            "Offset of field: ",
            stringify!(_typeobject),
            "::",
            stringify!(tp_mro)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_typeobject>())).tp_cache as *const _ as usize },
        352usize,
        concat!(
            "Offset of field: ",
            stringify!(_typeobject),
            "::",
            stringify!(tp_cache)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_typeobject>())).tp_subclasses as *const _ as usize },
        360usize,
        concat!(
            "Offset of field: ",
            stringify!(_typeobject),
            "::",
            stringify!(tp_subclasses)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_typeobject>())).tp_weaklist as *const _ as usize },
        368usize,
        concat!(
            "Offset of field: ",
            stringify!(_typeobject),
            "::",
            stringify!(tp_weaklist)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_typeobject>())).tp_del as *const _ as usize },
        376usize,
        concat!(
            "Offset of field: ",
            stringify!(_typeobject),
            "::",
            stringify!(tp_del)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_typeobject>())).tp_version_tag as *const _ as usize },
        384usize,
        concat!(
            "Offset of field: ",
            stringify!(_typeobject),
            "::",
            stringify!(tp_version_tag)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_typeobject>())).tp_finalize as *const _ as usize },
        392usize,
        concat!(
            "Offset of field: ",
            stringify!(_typeobject),
            "::",
            stringify!(tp_finalize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_typeobject>())).tp_vectorcall as *const _ as usize },
        400usize,
        concat!(
            "Offset of field: ",
            stringify!(_typeobject),
            "::",
            stringify!(tp_vectorcall)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _heaptypeobject {
    pub ht_type: PyTypeObject,
    pub as_async: PyAsyncMethods,
    pub as_number: PyNumberMethods,
    pub as_mapping: PyMappingMethods,
    pub as_sequence: PySequenceMethods,
    pub as_buffer: PyBufferProcs,
    pub ht_name: *mut PyObject,
    pub ht_slots: *mut PyObject,
    pub ht_qualname: *mut PyObject,
    pub ht_cached_keys: *mut _dictkeysobject,
    pub ht_module: *mut PyObject,
}
#[test]
fn bindgen_test_layout__heaptypeobject() {
    assert_eq!(
        ::std::mem::size_of::<_heaptypeobject>(),
        880usize,
        concat!("Size of: ", stringify!(_heaptypeobject))
    );
    assert_eq!(
        ::std::mem::align_of::<_heaptypeobject>(),
        8usize,
        concat!("Alignment of ", stringify!(_heaptypeobject))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_heaptypeobject>())).ht_type as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_heaptypeobject),
            "::",
            stringify!(ht_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_heaptypeobject>())).as_async as *const _ as usize },
        408usize,
        concat!(
            "Offset of field: ",
            stringify!(_heaptypeobject),
            "::",
            stringify!(as_async)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_heaptypeobject>())).as_number as *const _ as usize },
        432usize,
        concat!(
            "Offset of field: ",
            stringify!(_heaptypeobject),
            "::",
            stringify!(as_number)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_heaptypeobject>())).as_mapping as *const _ as usize },
        720usize,
        concat!(
            "Offset of field: ",
            stringify!(_heaptypeobject),
            "::",
            stringify!(as_mapping)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_heaptypeobject>())).as_sequence as *const _ as usize },
        744usize,
        concat!(
            "Offset of field: ",
            stringify!(_heaptypeobject),
            "::",
            stringify!(as_sequence)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_heaptypeobject>())).as_buffer as *const _ as usize },
        824usize,
        concat!(
            "Offset of field: ",
            stringify!(_heaptypeobject),
            "::",
            stringify!(as_buffer)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_heaptypeobject>())).ht_name as *const _ as usize },
        840usize,
        concat!(
            "Offset of field: ",
            stringify!(_heaptypeobject),
            "::",
            stringify!(ht_name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_heaptypeobject>())).ht_slots as *const _ as usize },
        848usize,
        concat!(
            "Offset of field: ",
            stringify!(_heaptypeobject),
            "::",
            stringify!(ht_slots)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_heaptypeobject>())).ht_qualname as *const _ as usize },
        856usize,
        concat!(
            "Offset of field: ",
            stringify!(_heaptypeobject),
            "::",
            stringify!(ht_qualname)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_heaptypeobject>())).ht_cached_keys as *const _ as usize },
        864usize,
        concat!(
            "Offset of field: ",
            stringify!(_heaptypeobject),
            "::",
            stringify!(ht_cached_keys)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_heaptypeobject>())).ht_module as *const _ as usize },
        872usize,
        concat!(
            "Offset of field: ",
            stringify!(_heaptypeobject),
            "::",
            stringify!(ht_module)
        )
    );
}
pub type PyHeapTypeObject = _heaptypeobject;
pub type _PyTime_t = i64;
pub const _PyTime_round_t__PyTime_ROUND_FLOOR: _PyTime_round_t = 0;
pub const _PyTime_round_t__PyTime_ROUND_CEILING: _PyTime_round_t = 1;
pub const _PyTime_round_t__PyTime_ROUND_HALF_EVEN: _PyTime_round_t = 2;
pub const _PyTime_round_t__PyTime_ROUND_UP: _PyTime_round_t = 3;
pub const _PyTime_round_t__PyTime_ROUND_TIMEOUT: _PyTime_round_t = 3;
pub type _PyTime_round_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _Py_clock_info_t {
    pub implementation: *const ::std::os::raw::c_char,
    pub monotonic: ::std::os::raw::c_int,
    pub adjustable: ::std::os::raw::c_int,
    pub resolution: f64,
}
#[test]
fn bindgen_test_layout__Py_clock_info_t() {
    assert_eq!(
        ::std::mem::size_of::<_Py_clock_info_t>(),
        24usize,
        concat!("Size of: ", stringify!(_Py_clock_info_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_Py_clock_info_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_Py_clock_info_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_Py_clock_info_t>())).implementation as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_Py_clock_info_t),
            "::",
            stringify!(implementation)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_Py_clock_info_t>())).monotonic as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_Py_clock_info_t),
            "::",
            stringify!(monotonic)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_Py_clock_info_t>())).adjustable as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_Py_clock_info_t),
            "::",
            stringify!(adjustable)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_Py_clock_info_t>())).resolution as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_Py_clock_info_t),
            "::",
            stringify!(resolution)
        )
    );
}
pub const PyMemAllocatorDomain_PYMEM_DOMAIN_RAW: PyMemAllocatorDomain = 0;
pub const PyMemAllocatorDomain_PYMEM_DOMAIN_MEM: PyMemAllocatorDomain = 1;
pub const PyMemAllocatorDomain_PYMEM_DOMAIN_OBJ: PyMemAllocatorDomain = 2;
pub type PyMemAllocatorDomain = ::std::os::raw::c_uint;
pub const PyMemAllocatorName_PYMEM_ALLOCATOR_NOT_SET: PyMemAllocatorName = 0;
pub const PyMemAllocatorName_PYMEM_ALLOCATOR_DEFAULT: PyMemAllocatorName = 1;
pub const PyMemAllocatorName_PYMEM_ALLOCATOR_DEBUG: PyMemAllocatorName = 2;
pub const PyMemAllocatorName_PYMEM_ALLOCATOR_MALLOC: PyMemAllocatorName = 3;
pub const PyMemAllocatorName_PYMEM_ALLOCATOR_MALLOC_DEBUG: PyMemAllocatorName = 4;
pub const PyMemAllocatorName_PYMEM_ALLOCATOR_PYMALLOC: PyMemAllocatorName = 5;
pub const PyMemAllocatorName_PYMEM_ALLOCATOR_PYMALLOC_DEBUG: PyMemAllocatorName = 6;
pub type PyMemAllocatorName = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PyMemAllocatorEx {
    pub ctx: *mut ::std::os::raw::c_void,
    pub malloc: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut ::std::os::raw::c_void,
            size: size_t,
        ) -> *mut ::std::os::raw::c_void,
    >,
    pub calloc: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut ::std::os::raw::c_void,
            nelem: size_t,
            elsize: size_t,
        ) -> *mut ::std::os::raw::c_void,
    >,
    pub realloc: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut ::std::os::raw::c_void,
            ptr: *mut ::std::os::raw::c_void,
            new_size: size_t,
        ) -> *mut ::std::os::raw::c_void,
    >,
    pub free: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut ::std::os::raw::c_void, ptr: *mut ::std::os::raw::c_void),
    >,
}
#[test]
fn bindgen_test_layout_PyMemAllocatorEx() {
    assert_eq!(
        ::std::mem::size_of::<PyMemAllocatorEx>(),
        40usize,
        concat!("Size of: ", stringify!(PyMemAllocatorEx))
    );
    assert_eq!(
        ::std::mem::align_of::<PyMemAllocatorEx>(),
        8usize,
        concat!("Alignment of ", stringify!(PyMemAllocatorEx))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyMemAllocatorEx>())).ctx as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PyMemAllocatorEx),
            "::",
            stringify!(ctx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyMemAllocatorEx>())).malloc as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(PyMemAllocatorEx),
            "::",
            stringify!(malloc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyMemAllocatorEx>())).calloc as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(PyMemAllocatorEx),
            "::",
            stringify!(calloc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyMemAllocatorEx>())).realloc as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(PyMemAllocatorEx),
            "::",
            stringify!(realloc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyMemAllocatorEx>())).free as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(PyMemAllocatorEx),
            "::",
            stringify!(free)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PyObjectArenaAllocator {
    pub ctx: *mut ::std::os::raw::c_void,
    pub alloc: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut ::std::os::raw::c_void,
            size: size_t,
        ) -> *mut ::std::os::raw::c_void,
    >,
    pub free: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut ::std::os::raw::c_void,
            ptr: *mut ::std::os::raw::c_void,
            size: size_t,
        ),
    >,
}
#[test]
fn bindgen_test_layout_PyObjectArenaAllocator() {
    assert_eq!(
        ::std::mem::size_of::<PyObjectArenaAllocator>(),
        24usize,
        concat!("Size of: ", stringify!(PyObjectArenaAllocator))
    );
    assert_eq!(
        ::std::mem::align_of::<PyObjectArenaAllocator>(),
        8usize,
        concat!("Alignment of ", stringify!(PyObjectArenaAllocator))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyObjectArenaAllocator>())).ctx as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PyObjectArenaAllocator),
            "::",
            stringify!(ctx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyObjectArenaAllocator>())).alloc as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(PyObjectArenaAllocator),
            "::",
            stringify!(alloc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyObjectArenaAllocator>())).free as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(PyObjectArenaAllocator),
            "::",
            stringify!(free)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _Py_HashSecret_t {
    pub uc: [::std::os::raw::c_uchar; 24usize],
    pub fnv: _Py_HashSecret_t__bindgen_ty_1,
    pub siphash: _Py_HashSecret_t__bindgen_ty_2,
    pub djbx33a: _Py_HashSecret_t__bindgen_ty_3,
    pub expat: _Py_HashSecret_t__bindgen_ty_4,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _Py_HashSecret_t__bindgen_ty_1 {
    pub prefix: Py_hash_t,
    pub suffix: Py_hash_t,
}
#[test]
fn bindgen_test_layout__Py_HashSecret_t__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_Py_HashSecret_t__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(_Py_HashSecret_t__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<_Py_HashSecret_t__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(_Py_HashSecret_t__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_Py_HashSecret_t__bindgen_ty_1>())).prefix as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_Py_HashSecret_t__bindgen_ty_1),
            "::",
            stringify!(prefix)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_Py_HashSecret_t__bindgen_ty_1>())).suffix as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_Py_HashSecret_t__bindgen_ty_1),
            "::",
            stringify!(suffix)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _Py_HashSecret_t__bindgen_ty_2 {
    pub k0: u64,
    pub k1: u64,
}
#[test]
fn bindgen_test_layout__Py_HashSecret_t__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<_Py_HashSecret_t__bindgen_ty_2>(),
        16usize,
        concat!("Size of: ", stringify!(_Py_HashSecret_t__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<_Py_HashSecret_t__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(_Py_HashSecret_t__bindgen_ty_2))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_Py_HashSecret_t__bindgen_ty_2>())).k0 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_Py_HashSecret_t__bindgen_ty_2),
            "::",
            stringify!(k0)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_Py_HashSecret_t__bindgen_ty_2>())).k1 as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_Py_HashSecret_t__bindgen_ty_2),
            "::",
            stringify!(k1)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _Py_HashSecret_t__bindgen_ty_3 {
    pub padding: [::std::os::raw::c_uchar; 16usize],
    pub suffix: Py_hash_t,
}
#[test]
fn bindgen_test_layout__Py_HashSecret_t__bindgen_ty_3() {
    assert_eq!(
        ::std::mem::size_of::<_Py_HashSecret_t__bindgen_ty_3>(),
        24usize,
        concat!("Size of: ", stringify!(_Py_HashSecret_t__bindgen_ty_3))
    );
    assert_eq!(
        ::std::mem::align_of::<_Py_HashSecret_t__bindgen_ty_3>(),
        8usize,
        concat!("Alignment of ", stringify!(_Py_HashSecret_t__bindgen_ty_3))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_Py_HashSecret_t__bindgen_ty_3>())).padding as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_Py_HashSecret_t__bindgen_ty_3),
            "::",
            stringify!(padding)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_Py_HashSecret_t__bindgen_ty_3>())).suffix as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_Py_HashSecret_t__bindgen_ty_3),
            "::",
            stringify!(suffix)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _Py_HashSecret_t__bindgen_ty_4 {
    pub padding: [::std::os::raw::c_uchar; 16usize],
    pub hashsalt: Py_hash_t,
}
#[test]
fn bindgen_test_layout__Py_HashSecret_t__bindgen_ty_4() {
    assert_eq!(
        ::std::mem::size_of::<_Py_HashSecret_t__bindgen_ty_4>(),
        24usize,
        concat!("Size of: ", stringify!(_Py_HashSecret_t__bindgen_ty_4))
    );
    assert_eq!(
        ::std::mem::align_of::<_Py_HashSecret_t__bindgen_ty_4>(),
        8usize,
        concat!("Alignment of ", stringify!(_Py_HashSecret_t__bindgen_ty_4))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_Py_HashSecret_t__bindgen_ty_4>())).padding as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_Py_HashSecret_t__bindgen_ty_4),
            "::",
            stringify!(padding)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_Py_HashSecret_t__bindgen_ty_4>())).hashsalt as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_Py_HashSecret_t__bindgen_ty_4),
            "::",
            stringify!(hashsalt)
        )
    );
}
#[test]
fn bindgen_test_layout__Py_HashSecret_t() {
    assert_eq!(
        ::std::mem::size_of::<_Py_HashSecret_t>(),
        24usize,
        concat!("Size of: ", stringify!(_Py_HashSecret_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_Py_HashSecret_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_Py_HashSecret_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_Py_HashSecret_t>())).uc as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_Py_HashSecret_t),
            "::",
            stringify!(uc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_Py_HashSecret_t>())).fnv as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_Py_HashSecret_t),
            "::",
            stringify!(fnv)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_Py_HashSecret_t>())).siphash as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_Py_HashSecret_t),
            "::",
            stringify!(siphash)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_Py_HashSecret_t>())).djbx33a as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_Py_HashSecret_t),
            "::",
            stringify!(djbx33a)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_Py_HashSecret_t>())).expat as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_Py_HashSecret_t),
            "::",
            stringify!(expat)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PyHash_FuncDef {
    pub hash: ::std::option::Option<
        unsafe extern "C" fn(arg1: *const ::std::os::raw::c_void, arg2: Py_ssize_t) -> Py_hash_t,
    >,
    pub name: *const ::std::os::raw::c_char,
    pub hash_bits: ::std::os::raw::c_int,
    pub seed_bits: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_PyHash_FuncDef() {
    assert_eq!(
        ::std::mem::size_of::<PyHash_FuncDef>(),
        24usize,
        concat!("Size of: ", stringify!(PyHash_FuncDef))
    );
    assert_eq!(
        ::std::mem::align_of::<PyHash_FuncDef>(),
        8usize,
        concat!("Alignment of ", stringify!(PyHash_FuncDef))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyHash_FuncDef>())).hash as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PyHash_FuncDef),
            "::",
            stringify!(hash)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyHash_FuncDef>())).name as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(PyHash_FuncDef),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyHash_FuncDef>())).hash_bits as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(PyHash_FuncDef),
            "::",
            stringify!(hash_bits)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyHash_FuncDef>())).seed_bits as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(PyHash_FuncDef),
            "::",
            stringify!(seed_bits)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PyByteArrayObject {
    pub ob_base: PyVarObject,
    pub ob_alloc: Py_ssize_t,
    pub ob_bytes: *mut ::std::os::raw::c_char,
    pub ob_start: *mut ::std::os::raw::c_char,
    pub ob_exports: Py_ssize_t,
}
#[test]
fn bindgen_test_layout_PyByteArrayObject() {
    assert_eq!(
        ::std::mem::size_of::<PyByteArrayObject>(),
        56usize,
        concat!("Size of: ", stringify!(PyByteArrayObject))
    );
    assert_eq!(
        ::std::mem::align_of::<PyByteArrayObject>(),
        8usize,
        concat!("Alignment of ", stringify!(PyByteArrayObject))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyByteArrayObject>())).ob_base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PyByteArrayObject),
            "::",
            stringify!(ob_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyByteArrayObject>())).ob_alloc as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(PyByteArrayObject),
            "::",
            stringify!(ob_alloc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyByteArrayObject>())).ob_bytes as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(PyByteArrayObject),
            "::",
            stringify!(ob_bytes)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyByteArrayObject>())).ob_start as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(PyByteArrayObject),
            "::",
            stringify!(ob_start)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyByteArrayObject>())).ob_exports as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(PyByteArrayObject),
            "::",
            stringify!(ob_exports)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PyBytesObject {
    pub ob_base: PyVarObject,
    pub ob_shash: Py_hash_t,
    pub ob_sval: [::std::os::raw::c_char; 1usize],
}
#[test]
fn bindgen_test_layout_PyBytesObject() {
    assert_eq!(
        ::std::mem::size_of::<PyBytesObject>(),
        40usize,
        concat!("Size of: ", stringify!(PyBytesObject))
    );
    assert_eq!(
        ::std::mem::align_of::<PyBytesObject>(),
        8usize,
        concat!("Alignment of ", stringify!(PyBytesObject))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyBytesObject>())).ob_base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PyBytesObject),
            "::",
            stringify!(ob_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyBytesObject>())).ob_shash as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(PyBytesObject),
            "::",
            stringify!(ob_shash)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyBytesObject>())).ob_sval as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(PyBytesObject),
            "::",
            stringify!(ob_sval)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _PyBytesWriter {
    pub buffer: *mut PyObject,
    pub allocated: Py_ssize_t,
    pub min_size: Py_ssize_t,
    pub use_bytearray: ::std::os::raw::c_int,
    pub overallocate: ::std::os::raw::c_int,
    pub use_small_buffer: ::std::os::raw::c_int,
    pub small_buffer: [::std::os::raw::c_char; 512usize],
}
#[test]
fn bindgen_test_layout__PyBytesWriter() {
    assert_eq!(
        ::std::mem::size_of::<_PyBytesWriter>(),
        552usize,
        concat!("Size of: ", stringify!(_PyBytesWriter))
    );
    assert_eq!(
        ::std::mem::align_of::<_PyBytesWriter>(),
        8usize,
        concat!("Alignment of ", stringify!(_PyBytesWriter))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_PyBytesWriter>())).buffer as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_PyBytesWriter),
            "::",
            stringify!(buffer)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_PyBytesWriter>())).allocated as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_PyBytesWriter),
            "::",
            stringify!(allocated)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_PyBytesWriter>())).min_size as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_PyBytesWriter),
            "::",
            stringify!(min_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_PyBytesWriter>())).use_bytearray as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_PyBytesWriter),
            "::",
            stringify!(use_bytearray)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_PyBytesWriter>())).overallocate as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_PyBytesWriter),
            "::",
            stringify!(overallocate)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_PyBytesWriter>())).use_small_buffer as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_PyBytesWriter),
            "::",
            stringify!(use_small_buffer)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_PyBytesWriter>())).small_buffer as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(_PyBytesWriter),
            "::",
            stringify!(small_buffer)
        )
    );
}
pub type Py_UCS4 = u32;
pub type Py_UCS2 = u16;
pub type Py_UCS1 = u8;
pub type Py_UNICODE = wchar_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PyASCIIObject {
    pub ob_base: PyObject,
    pub length: Py_ssize_t,
    pub hash: Py_hash_t,
    pub state: PyASCIIObject__bindgen_ty_1,
    pub wstr: *mut wchar_t,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct PyASCIIObject__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[test]
fn bindgen_test_layout_PyASCIIObject__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<PyASCIIObject__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(PyASCIIObject__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<PyASCIIObject__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(PyASCIIObject__bindgen_ty_1))
    );
}
impl PyASCIIObject__bindgen_ty_1 {
    #[inline]
    pub fn interned(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_interned(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn kind(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 3u8) as u32) }
    }
    #[inline]
    pub fn set_kind(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn compact(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_compact(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn ascii(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_ascii(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn ready(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_ready(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        interned: ::std::os::raw::c_uint,
        kind: ::std::os::raw::c_uint,
        compact: ::std::os::raw::c_uint,
        ascii: ::std::os::raw::c_uint,
        ready: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 2u8, {
            let interned: u32 = unsafe { ::std::mem::transmute(interned) };
            interned as u64
        });
        __bindgen_bitfield_unit.set(2usize, 3u8, {
            let kind: u32 = unsafe { ::std::mem::transmute(kind) };
            kind as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let compact: u32 = unsafe { ::std::mem::transmute(compact) };
            compact as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let ascii: u32 = unsafe { ::std::mem::transmute(ascii) };
            ascii as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let ready: u32 = unsafe { ::std::mem::transmute(ready) };
            ready as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_PyASCIIObject() {
    assert_eq!(
        ::std::mem::size_of::<PyASCIIObject>(),
        48usize,
        concat!("Size of: ", stringify!(PyASCIIObject))
    );
    assert_eq!(
        ::std::mem::align_of::<PyASCIIObject>(),
        8usize,
        concat!("Alignment of ", stringify!(PyASCIIObject))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyASCIIObject>())).ob_base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PyASCIIObject),
            "::",
            stringify!(ob_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyASCIIObject>())).length as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(PyASCIIObject),
            "::",
            stringify!(length)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyASCIIObject>())).hash as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(PyASCIIObject),
            "::",
            stringify!(hash)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyASCIIObject>())).state as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(PyASCIIObject),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyASCIIObject>())).wstr as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(PyASCIIObject),
            "::",
            stringify!(wstr)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PyCompactUnicodeObject {
    pub _base: PyASCIIObject,
    pub utf8_length: Py_ssize_t,
    pub utf8: *mut ::std::os::raw::c_char,
    pub wstr_length: Py_ssize_t,
}
#[test]
fn bindgen_test_layout_PyCompactUnicodeObject() {
    assert_eq!(
        ::std::mem::size_of::<PyCompactUnicodeObject>(),
        72usize,
        concat!("Size of: ", stringify!(PyCompactUnicodeObject))
    );
    assert_eq!(
        ::std::mem::align_of::<PyCompactUnicodeObject>(),
        8usize,
        concat!("Alignment of ", stringify!(PyCompactUnicodeObject))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyCompactUnicodeObject>()))._base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PyCompactUnicodeObject),
            "::",
            stringify!(_base)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<PyCompactUnicodeObject>())).utf8_length as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(PyCompactUnicodeObject),
            "::",
            stringify!(utf8_length)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyCompactUnicodeObject>())).utf8 as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(PyCompactUnicodeObject),
            "::",
            stringify!(utf8)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<PyCompactUnicodeObject>())).wstr_length as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(PyCompactUnicodeObject),
            "::",
            stringify!(wstr_length)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct PyUnicodeObject {
    pub _base: PyCompactUnicodeObject,
    pub data: PyUnicodeObject__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union PyUnicodeObject__bindgen_ty_1 {
    pub any: *mut ::std::os::raw::c_void,
    pub latin1: *mut Py_UCS1,
    pub ucs2: *mut Py_UCS2,
    pub ucs4: *mut Py_UCS4,
}
#[test]
fn bindgen_test_layout_PyUnicodeObject__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<PyUnicodeObject__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(PyUnicodeObject__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<PyUnicodeObject__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(PyUnicodeObject__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<PyUnicodeObject__bindgen_ty_1>())).any as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PyUnicodeObject__bindgen_ty_1),
            "::",
            stringify!(any)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<PyUnicodeObject__bindgen_ty_1>())).latin1 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PyUnicodeObject__bindgen_ty_1),
            "::",
            stringify!(latin1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<PyUnicodeObject__bindgen_ty_1>())).ucs2 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PyUnicodeObject__bindgen_ty_1),
            "::",
            stringify!(ucs2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<PyUnicodeObject__bindgen_ty_1>())).ucs4 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PyUnicodeObject__bindgen_ty_1),
            "::",
            stringify!(ucs4)
        )
    );
}
#[test]
fn bindgen_test_layout_PyUnicodeObject() {
    assert_eq!(
        ::std::mem::size_of::<PyUnicodeObject>(),
        80usize,
        concat!("Size of: ", stringify!(PyUnicodeObject))
    );
    assert_eq!(
        ::std::mem::align_of::<PyUnicodeObject>(),
        8usize,
        concat!("Alignment of ", stringify!(PyUnicodeObject))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyUnicodeObject>()))._base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PyUnicodeObject),
            "::",
            stringify!(_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyUnicodeObject>())).data as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(PyUnicodeObject),
            "::",
            stringify!(data)
        )
    );
}
pub const PyUnicode_Kind_PyUnicode_WCHAR_KIND: PyUnicode_Kind = 0;
pub const PyUnicode_Kind_PyUnicode_1BYTE_KIND: PyUnicode_Kind = 1;
pub const PyUnicode_Kind_PyUnicode_2BYTE_KIND: PyUnicode_Kind = 2;
pub const PyUnicode_Kind_PyUnicode_4BYTE_KIND: PyUnicode_Kind = 4;
pub type PyUnicode_Kind = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _PyUnicodeWriter {
    pub buffer: *mut PyObject,
    pub data: *mut ::std::os::raw::c_void,
    pub kind: PyUnicode_Kind,
    pub maxchar: Py_UCS4,
    pub size: Py_ssize_t,
    pub pos: Py_ssize_t,
    pub min_length: Py_ssize_t,
    pub min_char: Py_UCS4,
    pub overallocate: ::std::os::raw::c_uchar,
    pub readonly: ::std::os::raw::c_uchar,
}
#[test]
fn bindgen_test_layout__PyUnicodeWriter() {
    assert_eq!(
        ::std::mem::size_of::<_PyUnicodeWriter>(),
        56usize,
        concat!("Size of: ", stringify!(_PyUnicodeWriter))
    );
    assert_eq!(
        ::std::mem::align_of::<_PyUnicodeWriter>(),
        8usize,
        concat!("Alignment of ", stringify!(_PyUnicodeWriter))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_PyUnicodeWriter>())).buffer as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_PyUnicodeWriter),
            "::",
            stringify!(buffer)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_PyUnicodeWriter>())).data as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_PyUnicodeWriter),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_PyUnicodeWriter>())).kind as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_PyUnicodeWriter),
            "::",
            stringify!(kind)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_PyUnicodeWriter>())).maxchar as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_PyUnicodeWriter),
            "::",
            stringify!(maxchar)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_PyUnicodeWriter>())).size as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_PyUnicodeWriter),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_PyUnicodeWriter>())).pos as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_PyUnicodeWriter),
            "::",
            stringify!(pos)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_PyUnicodeWriter>())).min_length as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_PyUnicodeWriter),
            "::",
            stringify!(min_length)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_PyUnicodeWriter>())).min_char as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_PyUnicodeWriter),
            "::",
            stringify!(min_char)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_PyUnicodeWriter>())).overallocate as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(_PyUnicodeWriter),
            "::",
            stringify!(overallocate)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_PyUnicodeWriter>())).readonly as *const _ as usize },
        53usize,
        concat!(
            "Offset of field: ",
            stringify!(_PyUnicodeWriter),
            "::",
            stringify!(readonly)
        )
    );
}
pub type PyLongObject = _longobject;
pub type digit = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _longobject {
    pub ob_base: PyVarObject,
    pub ob_digit: [digit; 1usize],
}
#[test]
fn bindgen_test_layout__longobject() {
    assert_eq!(
        ::std::mem::size_of::<_longobject>(),
        32usize,
        concat!("Size of: ", stringify!(_longobject))
    );
    assert_eq!(
        ::std::mem::align_of::<_longobject>(),
        8usize,
        concat!("Alignment of ", stringify!(_longobject))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_longobject>())).ob_base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_longobject),
            "::",
            stringify!(ob_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_longobject>())).ob_digit as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_longobject),
            "::",
            stringify!(ob_digit)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PyFloatObject {
    pub ob_base: PyObject,
    pub ob_fval: f64,
}
#[test]
fn bindgen_test_layout_PyFloatObject() {
    assert_eq!(
        ::std::mem::size_of::<PyFloatObject>(),
        24usize,
        concat!("Size of: ", stringify!(PyFloatObject))
    );
    assert_eq!(
        ::std::mem::align_of::<PyFloatObject>(),
        8usize,
        concat!("Alignment of ", stringify!(PyFloatObject))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyFloatObject>())).ob_base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PyFloatObject),
            "::",
            stringify!(ob_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyFloatObject>())).ob_fval as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(PyFloatObject),
            "::",
            stringify!(ob_fval)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Py_complex {
    pub real: f64,
    pub imag: f64,
}
#[test]
fn bindgen_test_layout_Py_complex() {
    assert_eq!(
        ::std::mem::size_of::<Py_complex>(),
        16usize,
        concat!("Size of: ", stringify!(Py_complex))
    );
    assert_eq!(
        ::std::mem::align_of::<Py_complex>(),
        8usize,
        concat!("Alignment of ", stringify!(Py_complex))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Py_complex>())).real as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Py_complex),
            "::",
            stringify!(real)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Py_complex>())).imag as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Py_complex),
            "::",
            stringify!(imag)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PyComplexObject {
    pub ob_base: PyObject,
    pub cval: Py_complex,
}
#[test]
fn bindgen_test_layout_PyComplexObject() {
    assert_eq!(
        ::std::mem::size_of::<PyComplexObject>(),
        32usize,
        concat!("Size of: ", stringify!(PyComplexObject))
    );
    assert_eq!(
        ::std::mem::align_of::<PyComplexObject>(),
        8usize,
        concat!("Alignment of ", stringify!(PyComplexObject))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyComplexObject>())).ob_base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PyComplexObject),
            "::",
            stringify!(ob_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyComplexObject>())).cval as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(PyComplexObject),
            "::",
            stringify!(cval)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _PyManagedBufferObject {
    pub ob_base: PyObject,
    pub flags: ::std::os::raw::c_int,
    pub exports: Py_ssize_t,
    pub master: Py_buffer,
}
#[test]
fn bindgen_test_layout__PyManagedBufferObject() {
    assert_eq!(
        ::std::mem::size_of::<_PyManagedBufferObject>(),
        112usize,
        concat!("Size of: ", stringify!(_PyManagedBufferObject))
    );
    assert_eq!(
        ::std::mem::align_of::<_PyManagedBufferObject>(),
        8usize,
        concat!("Alignment of ", stringify!(_PyManagedBufferObject))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_PyManagedBufferObject>())).ob_base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_PyManagedBufferObject),
            "::",
            stringify!(ob_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_PyManagedBufferObject>())).flags as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_PyManagedBufferObject),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_PyManagedBufferObject>())).exports as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_PyManagedBufferObject),
            "::",
            stringify!(exports)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_PyManagedBufferObject>())).master as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_PyManagedBufferObject),
            "::",
            stringify!(master)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PyMemoryViewObject {
    pub ob_base: PyVarObject,
    pub mbuf: *mut _PyManagedBufferObject,
    pub hash: Py_hash_t,
    pub flags: ::std::os::raw::c_int,
    pub exports: Py_ssize_t,
    pub view: Py_buffer,
    pub weakreflist: *mut PyObject,
    pub ob_array: [Py_ssize_t; 1usize],
}
#[test]
fn bindgen_test_layout_PyMemoryViewObject() {
    assert_eq!(
        ::std::mem::size_of::<PyMemoryViewObject>(),
        152usize,
        concat!("Size of: ", stringify!(PyMemoryViewObject))
    );
    assert_eq!(
        ::std::mem::align_of::<PyMemoryViewObject>(),
        8usize,
        concat!("Alignment of ", stringify!(PyMemoryViewObject))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyMemoryViewObject>())).ob_base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PyMemoryViewObject),
            "::",
            stringify!(ob_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyMemoryViewObject>())).mbuf as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(PyMemoryViewObject),
            "::",
            stringify!(mbuf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyMemoryViewObject>())).hash as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(PyMemoryViewObject),
            "::",
            stringify!(hash)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyMemoryViewObject>())).flags as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(PyMemoryViewObject),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyMemoryViewObject>())).exports as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(PyMemoryViewObject),
            "::",
            stringify!(exports)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyMemoryViewObject>())).view as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(PyMemoryViewObject),
            "::",
            stringify!(view)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyMemoryViewObject>())).weakreflist as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(PyMemoryViewObject),
            "::",
            stringify!(weakreflist)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyMemoryViewObject>())).ob_array as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(PyMemoryViewObject),
            "::",
            stringify!(ob_array)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PyTupleObject {
    pub ob_base: PyVarObject,
    pub ob_item: [*mut PyObject; 1usize],
}
#[test]
fn bindgen_test_layout_PyTupleObject() {
    assert_eq!(
        ::std::mem::size_of::<PyTupleObject>(),
        32usize,
        concat!("Size of: ", stringify!(PyTupleObject))
    );
    assert_eq!(
        ::std::mem::align_of::<PyTupleObject>(),
        8usize,
        concat!("Alignment of ", stringify!(PyTupleObject))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyTupleObject>())).ob_base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PyTupleObject),
            "::",
            stringify!(ob_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyTupleObject>())).ob_item as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(PyTupleObject),
            "::",
            stringify!(ob_item)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PyListObject {
    pub ob_base: PyVarObject,
    pub ob_item: *mut *mut PyObject,
    pub allocated: Py_ssize_t,
}
#[test]
fn bindgen_test_layout_PyListObject() {
    assert_eq!(
        ::std::mem::size_of::<PyListObject>(),
        40usize,
        concat!("Size of: ", stringify!(PyListObject))
    );
    assert_eq!(
        ::std::mem::align_of::<PyListObject>(),
        8usize,
        concat!("Alignment of ", stringify!(PyListObject))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyListObject>())).ob_base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PyListObject),
            "::",
            stringify!(ob_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyListObject>())).ob_item as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(PyListObject),
            "::",
            stringify!(ob_item)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyListObject>())).allocated as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(PyListObject),
            "::",
            stringify!(allocated)
        )
    );
}
pub type PyDictKeysObject = _dictkeysobject;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PyDictObject {
    pub ob_base: PyObject,
    pub ma_used: Py_ssize_t,
    pub ma_version_tag: u64,
    pub ma_keys: *mut PyDictKeysObject,
    pub ma_values: *mut *mut PyObject,
}
#[test]
fn bindgen_test_layout_PyDictObject() {
    assert_eq!(
        ::std::mem::size_of::<PyDictObject>(),
        48usize,
        concat!("Size of: ", stringify!(PyDictObject))
    );
    assert_eq!(
        ::std::mem::align_of::<PyDictObject>(),
        8usize,
        concat!("Alignment of ", stringify!(PyDictObject))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyDictObject>())).ob_base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PyDictObject),
            "::",
            stringify!(ob_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyDictObject>())).ma_used as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(PyDictObject),
            "::",
            stringify!(ma_used)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyDictObject>())).ma_version_tag as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(PyDictObject),
            "::",
            stringify!(ma_version_tag)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyDictObject>())).ma_keys as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(PyDictObject),
            "::",
            stringify!(ma_keys)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyDictObject>())).ma_values as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(PyDictObject),
            "::",
            stringify!(ma_values)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _PyDictViewObject {
    pub ob_base: PyObject,
    pub dv_dict: *mut PyDictObject,
}
#[test]
fn bindgen_test_layout__PyDictViewObject() {
    assert_eq!(
        ::std::mem::size_of::<_PyDictViewObject>(),
        24usize,
        concat!("Size of: ", stringify!(_PyDictViewObject))
    );
    assert_eq!(
        ::std::mem::align_of::<_PyDictViewObject>(),
        8usize,
        concat!("Alignment of ", stringify!(_PyDictViewObject))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_PyDictViewObject>())).ob_base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_PyDictViewObject),
            "::",
            stringify!(ob_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_PyDictViewObject>())).dv_dict as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_PyDictViewObject),
            "::",
            stringify!(dv_dict)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _odictobject {
    _unused: [u8; 0],
}
pub type PyODictObject = _odictobject;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct setentry {
    pub key: *mut PyObject,
    pub hash: Py_hash_t,
}
#[test]
fn bindgen_test_layout_setentry() {
    assert_eq!(
        ::std::mem::size_of::<setentry>(),
        16usize,
        concat!("Size of: ", stringify!(setentry))
    );
    assert_eq!(
        ::std::mem::align_of::<setentry>(),
        8usize,
        concat!("Alignment of ", stringify!(setentry))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<setentry>())).key as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(setentry),
            "::",
            stringify!(key)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<setentry>())).hash as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(setentry),
            "::",
            stringify!(hash)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PySetObject {
    pub ob_base: PyObject,
    pub fill: Py_ssize_t,
    pub used: Py_ssize_t,
    pub mask: Py_ssize_t,
    pub table: *mut setentry,
    pub hash: Py_hash_t,
    pub finger: Py_ssize_t,
    pub smalltable: [setentry; 8usize],
    pub weakreflist: *mut PyObject,
}
#[test]
fn bindgen_test_layout_PySetObject() {
    assert_eq!(
        ::std::mem::size_of::<PySetObject>(),
        200usize,
        concat!("Size of: ", stringify!(PySetObject))
    );
    assert_eq!(
        ::std::mem::align_of::<PySetObject>(),
        8usize,
        concat!("Alignment of ", stringify!(PySetObject))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PySetObject>())).ob_base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PySetObject),
            "::",
            stringify!(ob_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PySetObject>())).fill as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(PySetObject),
            "::",
            stringify!(fill)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PySetObject>())).used as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(PySetObject),
            "::",
            stringify!(used)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PySetObject>())).mask as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(PySetObject),
            "::",
            stringify!(mask)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PySetObject>())).table as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(PySetObject),
            "::",
            stringify!(table)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PySetObject>())).hash as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(PySetObject),
            "::",
            stringify!(hash)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PySetObject>())).finger as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(PySetObject),
            "::",
            stringify!(finger)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PySetObject>())).smalltable as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(PySetObject),
            "::",
            stringify!(smalltable)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PySetObject>())).weakreflist as *const _ as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(PySetObject),
            "::",
            stringify!(weakreflist)
        )
    );
}
pub type PyCFunction = ::std::option::Option<
    unsafe extern "C" fn(arg1: *mut PyObject, arg2: *mut PyObject) -> *mut PyObject,
>;
pub type _PyCFunctionFast = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut PyObject,
        arg2: *const *mut PyObject,
        arg3: Py_ssize_t,
    ) -> *mut PyObject,
>;
pub type PyCFunctionWithKeywords = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut PyObject,
        arg2: *mut PyObject,
        arg3: *mut PyObject,
    ) -> *mut PyObject,
>;
pub type _PyCFunctionFastWithKeywords = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut PyObject,
        arg2: *const *mut PyObject,
        arg3: Py_ssize_t,
        arg4: *mut PyObject,
    ) -> *mut PyObject,
>;
pub type PyCMethod = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut PyObject,
        arg2: *mut PyTypeObject,
        arg3: *const *mut PyObject,
        arg4: size_t,
        arg5: *mut PyObject,
    ) -> *mut PyObject,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PyMethodDef {
    pub ml_name: *const ::std::os::raw::c_char,
    pub ml_meth: PyCFunction,
    pub ml_flags: ::std::os::raw::c_int,
    pub ml_doc: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_PyMethodDef() {
    assert_eq!(
        ::std::mem::size_of::<PyMethodDef>(),
        32usize,
        concat!("Size of: ", stringify!(PyMethodDef))
    );
    assert_eq!(
        ::std::mem::align_of::<PyMethodDef>(),
        8usize,
        concat!("Alignment of ", stringify!(PyMethodDef))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyMethodDef>())).ml_name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PyMethodDef),
            "::",
            stringify!(ml_name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyMethodDef>())).ml_meth as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(PyMethodDef),
            "::",
            stringify!(ml_meth)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyMethodDef>())).ml_flags as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(PyMethodDef),
            "::",
            stringify!(ml_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyMethodDef>())).ml_doc as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(PyMethodDef),
            "::",
            stringify!(ml_doc)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PyCFunctionObject {
    pub ob_base: PyObject,
    pub m_ml: *mut PyMethodDef,
    pub m_self: *mut PyObject,
    pub m_module: *mut PyObject,
    pub m_weakreflist: *mut PyObject,
    pub vectorcall: vectorcallfunc,
}
#[test]
fn bindgen_test_layout_PyCFunctionObject() {
    assert_eq!(
        ::std::mem::size_of::<PyCFunctionObject>(),
        56usize,
        concat!("Size of: ", stringify!(PyCFunctionObject))
    );
    assert_eq!(
        ::std::mem::align_of::<PyCFunctionObject>(),
        8usize,
        concat!("Alignment of ", stringify!(PyCFunctionObject))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyCFunctionObject>())).ob_base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PyCFunctionObject),
            "::",
            stringify!(ob_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyCFunctionObject>())).m_ml as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(PyCFunctionObject),
            "::",
            stringify!(m_ml)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyCFunctionObject>())).m_self as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(PyCFunctionObject),
            "::",
            stringify!(m_self)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyCFunctionObject>())).m_module as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(PyCFunctionObject),
            "::",
            stringify!(m_module)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyCFunctionObject>())).m_weakreflist as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(PyCFunctionObject),
            "::",
            stringify!(m_weakreflist)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyCFunctionObject>())).vectorcall as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(PyCFunctionObject),
            "::",
            stringify!(vectorcall)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PyCMethodObject {
    pub func: PyCFunctionObject,
    pub mm_class: *mut PyTypeObject,
}
#[test]
fn bindgen_test_layout_PyCMethodObject() {
    assert_eq!(
        ::std::mem::size_of::<PyCMethodObject>(),
        64usize,
        concat!("Size of: ", stringify!(PyCMethodObject))
    );
    assert_eq!(
        ::std::mem::align_of::<PyCMethodObject>(),
        8usize,
        concat!("Alignment of ", stringify!(PyCMethodObject))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyCMethodObject>())).func as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PyCMethodObject),
            "::",
            stringify!(func)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyCMethodObject>())).mm_class as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(PyCMethodObject),
            "::",
            stringify!(mm_class)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PyModuleDef_Base {
    pub ob_base: PyObject,
    pub m_init: ::std::option::Option<unsafe extern "C" fn() -> *mut PyObject>,
    pub m_index: Py_ssize_t,
    pub m_copy: *mut PyObject,
}
#[test]
fn bindgen_test_layout_PyModuleDef_Base() {
    assert_eq!(
        ::std::mem::size_of::<PyModuleDef_Base>(),
        40usize,
        concat!("Size of: ", stringify!(PyModuleDef_Base))
    );
    assert_eq!(
        ::std::mem::align_of::<PyModuleDef_Base>(),
        8usize,
        concat!("Alignment of ", stringify!(PyModuleDef_Base))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyModuleDef_Base>())).ob_base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PyModuleDef_Base),
            "::",
            stringify!(ob_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyModuleDef_Base>())).m_init as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(PyModuleDef_Base),
            "::",
            stringify!(m_init)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyModuleDef_Base>())).m_index as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(PyModuleDef_Base),
            "::",
            stringify!(m_index)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyModuleDef_Base>())).m_copy as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(PyModuleDef_Base),
            "::",
            stringify!(m_copy)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PyModuleDef_Slot {
    pub slot: ::std::os::raw::c_int,
    pub value: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_PyModuleDef_Slot() {
    assert_eq!(
        ::std::mem::size_of::<PyModuleDef_Slot>(),
        16usize,
        concat!("Size of: ", stringify!(PyModuleDef_Slot))
    );
    assert_eq!(
        ::std::mem::align_of::<PyModuleDef_Slot>(),
        8usize,
        concat!("Alignment of ", stringify!(PyModuleDef_Slot))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyModuleDef_Slot>())).slot as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PyModuleDef_Slot),
            "::",
            stringify!(slot)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyModuleDef_Slot>())).value as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(PyModuleDef_Slot),
            "::",
            stringify!(value)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PyModuleDef {
    pub m_base: PyModuleDef_Base,
    pub m_name: *const ::std::os::raw::c_char,
    pub m_doc: *const ::std::os::raw::c_char,
    pub m_size: Py_ssize_t,
    pub m_methods: *mut PyMethodDef,
    pub m_slots: *mut PyModuleDef_Slot,
    pub m_traverse: traverseproc,
    pub m_clear: inquiry,
    pub m_free: freefunc,
}
#[test]
fn bindgen_test_layout_PyModuleDef() {
    assert_eq!(
        ::std::mem::size_of::<PyModuleDef>(),
        104usize,
        concat!("Size of: ", stringify!(PyModuleDef))
    );
    assert_eq!(
        ::std::mem::align_of::<PyModuleDef>(),
        8usize,
        concat!("Alignment of ", stringify!(PyModuleDef))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyModuleDef>())).m_base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PyModuleDef),
            "::",
            stringify!(m_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyModuleDef>())).m_name as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(PyModuleDef),
            "::",
            stringify!(m_name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyModuleDef>())).m_doc as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(PyModuleDef),
            "::",
            stringify!(m_doc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyModuleDef>())).m_size as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(PyModuleDef),
            "::",
            stringify!(m_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyModuleDef>())).m_methods as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(PyModuleDef),
            "::",
            stringify!(m_methods)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyModuleDef>())).m_slots as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(PyModuleDef),
            "::",
            stringify!(m_slots)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyModuleDef>())).m_traverse as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(PyModuleDef),
            "::",
            stringify!(m_traverse)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyModuleDef>())).m_clear as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(PyModuleDef),
            "::",
            stringify!(m_clear)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyModuleDef>())).m_free as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(PyModuleDef),
            "::",
            stringify!(m_free)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PyFunctionObject {
    pub ob_base: PyObject,
    pub func_code: *mut PyObject,
    pub func_globals: *mut PyObject,
    pub func_defaults: *mut PyObject,
    pub func_kwdefaults: *mut PyObject,
    pub func_closure: *mut PyObject,
    pub func_doc: *mut PyObject,
    pub func_name: *mut PyObject,
    pub func_dict: *mut PyObject,
    pub func_weakreflist: *mut PyObject,
    pub func_module: *mut PyObject,
    pub func_annotations: *mut PyObject,
    pub func_qualname: *mut PyObject,
    pub vectorcall: vectorcallfunc,
}
#[test]
fn bindgen_test_layout_PyFunctionObject() {
    assert_eq!(
        ::std::mem::size_of::<PyFunctionObject>(),
        120usize,
        concat!("Size of: ", stringify!(PyFunctionObject))
    );
    assert_eq!(
        ::std::mem::align_of::<PyFunctionObject>(),
        8usize,
        concat!("Alignment of ", stringify!(PyFunctionObject))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyFunctionObject>())).ob_base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PyFunctionObject),
            "::",
            stringify!(ob_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyFunctionObject>())).func_code as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(PyFunctionObject),
            "::",
            stringify!(func_code)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyFunctionObject>())).func_globals as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(PyFunctionObject),
            "::",
            stringify!(func_globals)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyFunctionObject>())).func_defaults as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(PyFunctionObject),
            "::",
            stringify!(func_defaults)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<PyFunctionObject>())).func_kwdefaults as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(PyFunctionObject),
            "::",
            stringify!(func_kwdefaults)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyFunctionObject>())).func_closure as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(PyFunctionObject),
            "::",
            stringify!(func_closure)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyFunctionObject>())).func_doc as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(PyFunctionObject),
            "::",
            stringify!(func_doc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyFunctionObject>())).func_name as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(PyFunctionObject),
            "::",
            stringify!(func_name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyFunctionObject>())).func_dict as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(PyFunctionObject),
            "::",
            stringify!(func_dict)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<PyFunctionObject>())).func_weakreflist as *const _ as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(PyFunctionObject),
            "::",
            stringify!(func_weakreflist)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyFunctionObject>())).func_module as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(PyFunctionObject),
            "::",
            stringify!(func_module)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<PyFunctionObject>())).func_annotations as *const _ as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(PyFunctionObject),
            "::",
            stringify!(func_annotations)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyFunctionObject>())).func_qualname as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(PyFunctionObject),
            "::",
            stringify!(func_qualname)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyFunctionObject>())).vectorcall as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(PyFunctionObject),
            "::",
            stringify!(vectorcall)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PyMethodObject {
    pub ob_base: PyObject,
    pub im_func: *mut PyObject,
    pub im_self: *mut PyObject,
    pub im_weakreflist: *mut PyObject,
    pub vectorcall: vectorcallfunc,
}
#[test]
fn bindgen_test_layout_PyMethodObject() {
    assert_eq!(
        ::std::mem::size_of::<PyMethodObject>(),
        48usize,
        concat!("Size of: ", stringify!(PyMethodObject))
    );
    assert_eq!(
        ::std::mem::align_of::<PyMethodObject>(),
        8usize,
        concat!("Alignment of ", stringify!(PyMethodObject))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyMethodObject>())).ob_base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PyMethodObject),
            "::",
            stringify!(ob_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyMethodObject>())).im_func as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(PyMethodObject),
            "::",
            stringify!(im_func)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyMethodObject>())).im_self as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(PyMethodObject),
            "::",
            stringify!(im_self)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyMethodObject>())).im_weakreflist as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(PyMethodObject),
            "::",
            stringify!(im_weakreflist)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyMethodObject>())).vectorcall as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(PyMethodObject),
            "::",
            stringify!(vectorcall)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PyInstanceMethodObject {
    pub ob_base: PyObject,
    pub func: *mut PyObject,
}
#[test]
fn bindgen_test_layout_PyInstanceMethodObject() {
    assert_eq!(
        ::std::mem::size_of::<PyInstanceMethodObject>(),
        24usize,
        concat!("Size of: ", stringify!(PyInstanceMethodObject))
    );
    assert_eq!(
        ::std::mem::align_of::<PyInstanceMethodObject>(),
        8usize,
        concat!("Alignment of ", stringify!(PyInstanceMethodObject))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyInstanceMethodObject>())).ob_base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PyInstanceMethodObject),
            "::",
            stringify!(ob_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyInstanceMethodObject>())).func as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(PyInstanceMethodObject),
            "::",
            stringify!(func)
        )
    );
}
pub type Py_OpenCodeHookFunction = ::std::option::Option<
    unsafe extern "C" fn(arg1: *mut PyObject, arg2: *mut ::std::os::raw::c_void) -> *mut PyObject,
>;
pub type PyCapsule_Destructor = ::std::option::Option<unsafe extern "C" fn(arg1: *mut PyObject)>;
pub type _Py_CODEUNIT = u16;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _PyOpcache {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PyCodeObject {
    pub ob_base: PyObject,
    pub co_argcount: ::std::os::raw::c_int,
    pub co_posonlyargcount: ::std::os::raw::c_int,
    pub co_kwonlyargcount: ::std::os::raw::c_int,
    pub co_nlocals: ::std::os::raw::c_int,
    pub co_stacksize: ::std::os::raw::c_int,
    pub co_flags: ::std::os::raw::c_int,
    pub co_firstlineno: ::std::os::raw::c_int,
    pub co_code: *mut PyObject,
    pub co_consts: *mut PyObject,
    pub co_names: *mut PyObject,
    pub co_varnames: *mut PyObject,
    pub co_freevars: *mut PyObject,
    pub co_cellvars: *mut PyObject,
    pub co_cell2arg: *mut Py_ssize_t,
    pub co_filename: *mut PyObject,
    pub co_name: *mut PyObject,
    pub co_lnotab: *mut PyObject,
    pub co_zombieframe: *mut ::std::os::raw::c_void,
    pub co_weakreflist: *mut PyObject,
    pub co_extra: *mut ::std::os::raw::c_void,
    pub co_opcache_map: *mut ::std::os::raw::c_uchar,
    pub co_opcache: *mut _PyOpcache,
    pub co_opcache_flag: ::std::os::raw::c_int,
    pub co_opcache_size: ::std::os::raw::c_uchar,
}
#[test]
fn bindgen_test_layout_PyCodeObject() {
    assert_eq!(
        ::std::mem::size_of::<PyCodeObject>(),
        176usize,
        concat!("Size of: ", stringify!(PyCodeObject))
    );
    assert_eq!(
        ::std::mem::align_of::<PyCodeObject>(),
        8usize,
        concat!("Alignment of ", stringify!(PyCodeObject))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyCodeObject>())).ob_base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PyCodeObject),
            "::",
            stringify!(ob_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyCodeObject>())).co_argcount as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(PyCodeObject),
            "::",
            stringify!(co_argcount)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyCodeObject>())).co_posonlyargcount as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(PyCodeObject),
            "::",
            stringify!(co_posonlyargcount)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyCodeObject>())).co_kwonlyargcount as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(PyCodeObject),
            "::",
            stringify!(co_kwonlyargcount)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyCodeObject>())).co_nlocals as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(PyCodeObject),
            "::",
            stringify!(co_nlocals)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyCodeObject>())).co_stacksize as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(PyCodeObject),
            "::",
            stringify!(co_stacksize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyCodeObject>())).co_flags as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(PyCodeObject),
            "::",
            stringify!(co_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyCodeObject>())).co_firstlineno as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(PyCodeObject),
            "::",
            stringify!(co_firstlineno)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyCodeObject>())).co_code as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(PyCodeObject),
            "::",
            stringify!(co_code)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyCodeObject>())).co_consts as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(PyCodeObject),
            "::",
            stringify!(co_consts)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyCodeObject>())).co_names as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(PyCodeObject),
            "::",
            stringify!(co_names)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyCodeObject>())).co_varnames as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(PyCodeObject),
            "::",
            stringify!(co_varnames)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyCodeObject>())).co_freevars as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(PyCodeObject),
            "::",
            stringify!(co_freevars)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyCodeObject>())).co_cellvars as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(PyCodeObject),
            "::",
            stringify!(co_cellvars)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyCodeObject>())).co_cell2arg as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(PyCodeObject),
            "::",
            stringify!(co_cell2arg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyCodeObject>())).co_filename as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(PyCodeObject),
            "::",
            stringify!(co_filename)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyCodeObject>())).co_name as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(PyCodeObject),
            "::",
            stringify!(co_name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyCodeObject>())).co_lnotab as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(PyCodeObject),
            "::",
            stringify!(co_lnotab)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyCodeObject>())).co_zombieframe as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(PyCodeObject),
            "::",
            stringify!(co_zombieframe)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyCodeObject>())).co_weakreflist as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(PyCodeObject),
            "::",
            stringify!(co_weakreflist)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyCodeObject>())).co_extra as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(PyCodeObject),
            "::",
            stringify!(co_extra)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyCodeObject>())).co_opcache_map as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(PyCodeObject),
            "::",
            stringify!(co_opcache_map)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyCodeObject>())).co_opcache as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(PyCodeObject),
            "::",
            stringify!(co_opcache)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyCodeObject>())).co_opcache_flag as *const _ as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(PyCodeObject),
            "::",
            stringify!(co_opcache_flag)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyCodeObject>())).co_opcache_size as *const _ as usize },
        172usize,
        concat!(
            "Offset of field: ",
            stringify!(PyCodeObject),
            "::",
            stringify!(co_opcache_size)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _addr_pair {
    pub ap_lower: ::std::os::raw::c_int,
    pub ap_upper: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout__addr_pair() {
    assert_eq!(
        ::std::mem::size_of::<_addr_pair>(),
        8usize,
        concat!("Size of: ", stringify!(_addr_pair))
    );
    assert_eq!(
        ::std::mem::align_of::<_addr_pair>(),
        4usize,
        concat!("Alignment of ", stringify!(_addr_pair))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_addr_pair>())).ap_lower as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_addr_pair),
            "::",
            stringify!(ap_lower)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_addr_pair>())).ap_upper as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_addr_pair),
            "::",
            stringify!(ap_upper)
        )
    );
}
pub type PyAddrPair = _addr_pair;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _frame {
    _unused: [u8; 0],
}
pub type PyFrameObject = _frame;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _traceback {
    pub ob_base: PyObject,
    pub tb_next: *mut _traceback,
    pub tb_frame: *mut PyFrameObject,
    pub tb_lasti: ::std::os::raw::c_int,
    pub tb_lineno: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout__traceback() {
    assert_eq!(
        ::std::mem::size_of::<_traceback>(),
        40usize,
        concat!("Size of: ", stringify!(_traceback))
    );
    assert_eq!(
        ::std::mem::align_of::<_traceback>(),
        8usize,
        concat!("Alignment of ", stringify!(_traceback))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_traceback>())).ob_base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_traceback),
            "::",
            stringify!(ob_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_traceback>())).tb_next as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_traceback),
            "::",
            stringify!(tb_next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_traceback>())).tb_frame as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_traceback),
            "::",
            stringify!(tb_frame)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_traceback>())).tb_lasti as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_traceback),
            "::",
            stringify!(tb_lasti)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_traceback>())).tb_lineno as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(_traceback),
            "::",
            stringify!(tb_lineno)
        )
    );
}
pub type PyTracebackObject = _traceback;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PySliceObject {
    pub ob_base: PyObject,
    pub start: *mut PyObject,
    pub stop: *mut PyObject,
    pub step: *mut PyObject,
}
#[test]
fn bindgen_test_layout_PySliceObject() {
    assert_eq!(
        ::std::mem::size_of::<PySliceObject>(),
        40usize,
        concat!("Size of: ", stringify!(PySliceObject))
    );
    assert_eq!(
        ::std::mem::align_of::<PySliceObject>(),
        8usize,
        concat!("Alignment of ", stringify!(PySliceObject))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PySliceObject>())).ob_base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PySliceObject),
            "::",
            stringify!(ob_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PySliceObject>())).start as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(PySliceObject),
            "::",
            stringify!(start)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PySliceObject>())).stop as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(PySliceObject),
            "::",
            stringify!(stop)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PySliceObject>())).step as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(PySliceObject),
            "::",
            stringify!(step)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PyCellObject {
    pub ob_base: PyObject,
    pub ob_ref: *mut PyObject,
}
#[test]
fn bindgen_test_layout_PyCellObject() {
    assert_eq!(
        ::std::mem::size_of::<PyCellObject>(),
        24usize,
        concat!("Size of: ", stringify!(PyCellObject))
    );
    assert_eq!(
        ::std::mem::align_of::<PyCellObject>(),
        8usize,
        concat!("Alignment of ", stringify!(PyCellObject))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyCellObject>())).ob_base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PyCellObject),
            "::",
            stringify!(ob_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyCellObject>())).ob_ref as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(PyCellObject),
            "::",
            stringify!(ob_ref)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _is {
    _unused: [u8; 0],
}
pub type PyThreadState = _ts;
pub type PyInterpreterState = _is;
pub const PyGILState_STATE_PyGILState_LOCKED: PyGILState_STATE = 0;
pub const PyGILState_STATE_PyGILState_UNLOCKED: PyGILState_STATE = 1;
pub type PyGILState_STATE = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PyStatus {
    pub _type: PyStatus__bindgen_ty_1,
    pub func: *const ::std::os::raw::c_char,
    pub err_msg: *const ::std::os::raw::c_char,
    pub exitcode: ::std::os::raw::c_int,
}
pub const PyStatus__PyStatus_TYPE_OK: ::std::os::raw::c_uint = 0;
pub const PyStatus__PyStatus_TYPE_ERROR: ::std::os::raw::c_uint = 1;
pub const PyStatus__PyStatus_TYPE_EXIT: ::std::os::raw::c_uint = 2;
pub type PyStatus__bindgen_ty_1 = ::std::os::raw::c_uint;
#[test]
fn bindgen_test_layout_PyStatus() {
    assert_eq!(
        ::std::mem::size_of::<PyStatus>(),
        32usize,
        concat!("Size of: ", stringify!(PyStatus))
    );
    assert_eq!(
        ::std::mem::align_of::<PyStatus>(),
        8usize,
        concat!("Alignment of ", stringify!(PyStatus))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyStatus>()))._type as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PyStatus),
            "::",
            stringify!(_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyStatus>())).func as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(PyStatus),
            "::",
            stringify!(func)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyStatus>())).err_msg as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(PyStatus),
            "::",
            stringify!(err_msg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyStatus>())).exitcode as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(PyStatus),
            "::",
            stringify!(exitcode)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PyWideStringList {
    pub length: Py_ssize_t,
    pub items: *mut *mut wchar_t,
}
#[test]
fn bindgen_test_layout_PyWideStringList() {
    assert_eq!(
        ::std::mem::size_of::<PyWideStringList>(),
        16usize,
        concat!("Size of: ", stringify!(PyWideStringList))
    );
    assert_eq!(
        ::std::mem::align_of::<PyWideStringList>(),
        8usize,
        concat!("Alignment of ", stringify!(PyWideStringList))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyWideStringList>())).length as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PyWideStringList),
            "::",
            stringify!(length)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyWideStringList>())).items as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(PyWideStringList),
            "::",
            stringify!(items)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PyPreConfig {
    pub _config_init: ::std::os::raw::c_int,
    pub parse_argv: ::std::os::raw::c_int,
    pub isolated: ::std::os::raw::c_int,
    pub use_environment: ::std::os::raw::c_int,
    pub configure_locale: ::std::os::raw::c_int,
    pub coerce_c_locale: ::std::os::raw::c_int,
    pub coerce_c_locale_warn: ::std::os::raw::c_int,
    pub utf8_mode: ::std::os::raw::c_int,
    pub dev_mode: ::std::os::raw::c_int,
    pub allocator: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_PyPreConfig() {
    assert_eq!(
        ::std::mem::size_of::<PyPreConfig>(),
        40usize,
        concat!("Size of: ", stringify!(PyPreConfig))
    );
    assert_eq!(
        ::std::mem::align_of::<PyPreConfig>(),
        4usize,
        concat!("Alignment of ", stringify!(PyPreConfig))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyPreConfig>()))._config_init as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PyPreConfig),
            "::",
            stringify!(_config_init)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyPreConfig>())).parse_argv as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(PyPreConfig),
            "::",
            stringify!(parse_argv)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyPreConfig>())).isolated as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(PyPreConfig),
            "::",
            stringify!(isolated)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyPreConfig>())).use_environment as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(PyPreConfig),
            "::",
            stringify!(use_environment)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyPreConfig>())).configure_locale as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(PyPreConfig),
            "::",
            stringify!(configure_locale)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyPreConfig>())).coerce_c_locale as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(PyPreConfig),
            "::",
            stringify!(coerce_c_locale)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<PyPreConfig>())).coerce_c_locale_warn as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(PyPreConfig),
            "::",
            stringify!(coerce_c_locale_warn)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyPreConfig>())).utf8_mode as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(PyPreConfig),
            "::",
            stringify!(utf8_mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyPreConfig>())).dev_mode as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(PyPreConfig),
            "::",
            stringify!(dev_mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyPreConfig>())).allocator as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(PyPreConfig),
            "::",
            stringify!(allocator)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PyConfig {
    pub _config_init: ::std::os::raw::c_int,
    pub isolated: ::std::os::raw::c_int,
    pub use_environment: ::std::os::raw::c_int,
    pub dev_mode: ::std::os::raw::c_int,
    pub install_signal_handlers: ::std::os::raw::c_int,
    pub use_hash_seed: ::std::os::raw::c_int,
    pub hash_seed: ::std::os::raw::c_ulong,
    pub faulthandler: ::std::os::raw::c_int,
    pub _use_peg_parser: ::std::os::raw::c_int,
    pub tracemalloc: ::std::os::raw::c_int,
    pub import_time: ::std::os::raw::c_int,
    pub show_ref_count: ::std::os::raw::c_int,
    pub dump_refs: ::std::os::raw::c_int,
    pub malloc_stats: ::std::os::raw::c_int,
    pub filesystem_encoding: *mut wchar_t,
    pub filesystem_errors: *mut wchar_t,
    pub pycache_prefix: *mut wchar_t,
    pub parse_argv: ::std::os::raw::c_int,
    pub argv: PyWideStringList,
    pub program_name: *mut wchar_t,
    pub xoptions: PyWideStringList,
    pub warnoptions: PyWideStringList,
    pub site_import: ::std::os::raw::c_int,
    pub bytes_warning: ::std::os::raw::c_int,
    pub inspect: ::std::os::raw::c_int,
    pub interactive: ::std::os::raw::c_int,
    pub optimization_level: ::std::os::raw::c_int,
    pub parser_debug: ::std::os::raw::c_int,
    pub write_bytecode: ::std::os::raw::c_int,
    pub verbose: ::std::os::raw::c_int,
    pub quiet: ::std::os::raw::c_int,
    pub user_site_directory: ::std::os::raw::c_int,
    pub configure_c_stdio: ::std::os::raw::c_int,
    pub buffered_stdio: ::std::os::raw::c_int,
    pub stdio_encoding: *mut wchar_t,
    pub stdio_errors: *mut wchar_t,
    pub check_hash_pycs_mode: *mut wchar_t,
    pub pathconfig_warnings: ::std::os::raw::c_int,
    pub pythonpath_env: *mut wchar_t,
    pub home: *mut wchar_t,
    pub module_search_paths_set: ::std::os::raw::c_int,
    pub module_search_paths: PyWideStringList,
    pub executable: *mut wchar_t,
    pub base_executable: *mut wchar_t,
    pub prefix: *mut wchar_t,
    pub base_prefix: *mut wchar_t,
    pub exec_prefix: *mut wchar_t,
    pub base_exec_prefix: *mut wchar_t,
    pub platlibdir: *mut wchar_t,
    pub skip_source_first_line: ::std::os::raw::c_int,
    pub run_command: *mut wchar_t,
    pub run_module: *mut wchar_t,
    pub run_filename: *mut wchar_t,
    pub _install_importlib: ::std::os::raw::c_int,
    pub _init_main: ::std::os::raw::c_int,
    pub _isolated_interpreter: ::std::os::raw::c_int,
    pub _orig_argv: PyWideStringList,
}
#[test]
fn bindgen_test_layout_PyConfig() {
    assert_eq!(
        ::std::mem::size_of::<PyConfig>(),
        392usize,
        concat!("Size of: ", stringify!(PyConfig))
    );
    assert_eq!(
        ::std::mem::align_of::<PyConfig>(),
        8usize,
        concat!("Alignment of ", stringify!(PyConfig))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyConfig>()))._config_init as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PyConfig),
            "::",
            stringify!(_config_init)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyConfig>())).isolated as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(PyConfig),
            "::",
            stringify!(isolated)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyConfig>())).use_environment as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(PyConfig),
            "::",
            stringify!(use_environment)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyConfig>())).dev_mode as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(PyConfig),
            "::",
            stringify!(dev_mode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<PyConfig>())).install_signal_handlers as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(PyConfig),
            "::",
            stringify!(install_signal_handlers)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyConfig>())).use_hash_seed as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(PyConfig),
            "::",
            stringify!(use_hash_seed)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyConfig>())).hash_seed as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(PyConfig),
            "::",
            stringify!(hash_seed)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyConfig>())).faulthandler as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(PyConfig),
            "::",
            stringify!(faulthandler)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyConfig>()))._use_peg_parser as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(PyConfig),
            "::",
            stringify!(_use_peg_parser)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyConfig>())).tracemalloc as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(PyConfig),
            "::",
            stringify!(tracemalloc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyConfig>())).import_time as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(PyConfig),
            "::",
            stringify!(import_time)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyConfig>())).show_ref_count as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(PyConfig),
            "::",
            stringify!(show_ref_count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyConfig>())).dump_refs as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(PyConfig),
            "::",
            stringify!(dump_refs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyConfig>())).malloc_stats as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(PyConfig),
            "::",
            stringify!(malloc_stats)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyConfig>())).filesystem_encoding as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(PyConfig),
            "::",
            stringify!(filesystem_encoding)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyConfig>())).filesystem_errors as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(PyConfig),
            "::",
            stringify!(filesystem_errors)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyConfig>())).pycache_prefix as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(PyConfig),
            "::",
            stringify!(pycache_prefix)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyConfig>())).parse_argv as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(PyConfig),
            "::",
            stringify!(parse_argv)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyConfig>())).argv as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(PyConfig),
            "::",
            stringify!(argv)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyConfig>())).program_name as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(PyConfig),
            "::",
            stringify!(program_name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyConfig>())).xoptions as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(PyConfig),
            "::",
            stringify!(xoptions)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyConfig>())).warnoptions as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(PyConfig),
            "::",
            stringify!(warnoptions)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyConfig>())).site_import as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(PyConfig),
            "::",
            stringify!(site_import)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyConfig>())).bytes_warning as *const _ as usize },
        156usize,
        concat!(
            "Offset of field: ",
            stringify!(PyConfig),
            "::",
            stringify!(bytes_warning)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyConfig>())).inspect as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(PyConfig),
            "::",
            stringify!(inspect)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyConfig>())).interactive as *const _ as usize },
        164usize,
        concat!(
            "Offset of field: ",
            stringify!(PyConfig),
            "::",
            stringify!(interactive)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyConfig>())).optimization_level as *const _ as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(PyConfig),
            "::",
            stringify!(optimization_level)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyConfig>())).parser_debug as *const _ as usize },
        172usize,
        concat!(
            "Offset of field: ",
            stringify!(PyConfig),
            "::",
            stringify!(parser_debug)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyConfig>())).write_bytecode as *const _ as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(PyConfig),
            "::",
            stringify!(write_bytecode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyConfig>())).verbose as *const _ as usize },
        180usize,
        concat!(
            "Offset of field: ",
            stringify!(PyConfig),
            "::",
            stringify!(verbose)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyConfig>())).quiet as *const _ as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(PyConfig),
            "::",
            stringify!(quiet)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyConfig>())).user_site_directory as *const _ as usize },
        188usize,
        concat!(
            "Offset of field: ",
            stringify!(PyConfig),
            "::",
            stringify!(user_site_directory)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyConfig>())).configure_c_stdio as *const _ as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(PyConfig),
            "::",
            stringify!(configure_c_stdio)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyConfig>())).buffered_stdio as *const _ as usize },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(PyConfig),
            "::",
            stringify!(buffered_stdio)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyConfig>())).stdio_encoding as *const _ as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(PyConfig),
            "::",
            stringify!(stdio_encoding)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyConfig>())).stdio_errors as *const _ as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(PyConfig),
            "::",
            stringify!(stdio_errors)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyConfig>())).check_hash_pycs_mode as *const _ as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(PyConfig),
            "::",
            stringify!(check_hash_pycs_mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyConfig>())).pathconfig_warnings as *const _ as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(PyConfig),
            "::",
            stringify!(pathconfig_warnings)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyConfig>())).pythonpath_env as *const _ as usize },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(PyConfig),
            "::",
            stringify!(pythonpath_env)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyConfig>())).home as *const _ as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(PyConfig),
            "::",
            stringify!(home)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<PyConfig>())).module_search_paths_set as *const _ as usize
        },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(PyConfig),
            "::",
            stringify!(module_search_paths_set)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyConfig>())).module_search_paths as *const _ as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(PyConfig),
            "::",
            stringify!(module_search_paths)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyConfig>())).executable as *const _ as usize },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(PyConfig),
            "::",
            stringify!(executable)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyConfig>())).base_executable as *const _ as usize },
        280usize,
        concat!(
            "Offset of field: ",
            stringify!(PyConfig),
            "::",
            stringify!(base_executable)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyConfig>())).prefix as *const _ as usize },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(PyConfig),
            "::",
            stringify!(prefix)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyConfig>())).base_prefix as *const _ as usize },
        296usize,
        concat!(
            "Offset of field: ",
            stringify!(PyConfig),
            "::",
            stringify!(base_prefix)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyConfig>())).exec_prefix as *const _ as usize },
        304usize,
        concat!(
            "Offset of field: ",
            stringify!(PyConfig),
            "::",
            stringify!(exec_prefix)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyConfig>())).base_exec_prefix as *const _ as usize },
        312usize,
        concat!(
            "Offset of field: ",
            stringify!(PyConfig),
            "::",
            stringify!(base_exec_prefix)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyConfig>())).platlibdir as *const _ as usize },
        320usize,
        concat!(
            "Offset of field: ",
            stringify!(PyConfig),
            "::",
            stringify!(platlibdir)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyConfig>())).skip_source_first_line as *const _ as usize },
        328usize,
        concat!(
            "Offset of field: ",
            stringify!(PyConfig),
            "::",
            stringify!(skip_source_first_line)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyConfig>())).run_command as *const _ as usize },
        336usize,
        concat!(
            "Offset of field: ",
            stringify!(PyConfig),
            "::",
            stringify!(run_command)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyConfig>())).run_module as *const _ as usize },
        344usize,
        concat!(
            "Offset of field: ",
            stringify!(PyConfig),
            "::",
            stringify!(run_module)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyConfig>())).run_filename as *const _ as usize },
        352usize,
        concat!(
            "Offset of field: ",
            stringify!(PyConfig),
            "::",
            stringify!(run_filename)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyConfig>()))._install_importlib as *const _ as usize },
        360usize,
        concat!(
            "Offset of field: ",
            stringify!(PyConfig),
            "::",
            stringify!(_install_importlib)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyConfig>()))._init_main as *const _ as usize },
        364usize,
        concat!(
            "Offset of field: ",
            stringify!(PyConfig),
            "::",
            stringify!(_init_main)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyConfig>()))._isolated_interpreter as *const _ as usize },
        368usize,
        concat!(
            "Offset of field: ",
            stringify!(PyConfig),
            "::",
            stringify!(_isolated_interpreter)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyConfig>()))._orig_argv as *const _ as usize },
        376usize,
        concat!(
            "Offset of field: ",
            stringify!(PyConfig),
            "::",
            stringify!(_orig_argv)
        )
    );
}
pub type Py_tracefunc = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut PyObject,
        arg2: *mut PyFrameObject,
        arg3: ::std::os::raw::c_int,
        arg4: *mut PyObject,
    ) -> ::std::os::raw::c_int,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _err_stackitem {
    pub exc_type: *mut PyObject,
    pub exc_value: *mut PyObject,
    pub exc_traceback: *mut PyObject,
    pub previous_item: *mut _err_stackitem,
}
#[test]
fn bindgen_test_layout__err_stackitem() {
    assert_eq!(
        ::std::mem::size_of::<_err_stackitem>(),
        32usize,
        concat!("Size of: ", stringify!(_err_stackitem))
    );
    assert_eq!(
        ::std::mem::align_of::<_err_stackitem>(),
        8usize,
        concat!("Alignment of ", stringify!(_err_stackitem))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_err_stackitem>())).exc_type as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_err_stackitem),
            "::",
            stringify!(exc_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_err_stackitem>())).exc_value as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_err_stackitem),
            "::",
            stringify!(exc_value)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_err_stackitem>())).exc_traceback as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_err_stackitem),
            "::",
            stringify!(exc_traceback)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_err_stackitem>())).previous_item as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_err_stackitem),
            "::",
            stringify!(previous_item)
        )
    );
}
pub type _PyErr_StackItem = _err_stackitem;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ts {
    pub prev: *mut _ts,
    pub next: *mut _ts,
    pub interp: *mut PyInterpreterState,
    pub frame: *mut PyFrameObject,
    pub recursion_depth: ::std::os::raw::c_int,
    pub overflowed: ::std::os::raw::c_char,
    pub recursion_critical: ::std::os::raw::c_char,
    pub stackcheck_counter: ::std::os::raw::c_int,
    pub tracing: ::std::os::raw::c_int,
    pub use_tracing: ::std::os::raw::c_int,
    pub c_profilefunc: Py_tracefunc,
    pub c_tracefunc: Py_tracefunc,
    pub c_profileobj: *mut PyObject,
    pub c_traceobj: *mut PyObject,
    pub curexc_type: *mut PyObject,
    pub curexc_value: *mut PyObject,
    pub curexc_traceback: *mut PyObject,
    pub exc_state: _PyErr_StackItem,
    pub exc_info: *mut _PyErr_StackItem,
    pub dict: *mut PyObject,
    pub gilstate_counter: ::std::os::raw::c_int,
    pub async_exc: *mut PyObject,
    pub thread_id: ::std::os::raw::c_ulong,
    pub trash_delete_nesting: ::std::os::raw::c_int,
    pub trash_delete_later: *mut PyObject,
    pub on_delete: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    pub on_delete_data: *mut ::std::os::raw::c_void,
    pub coroutine_origin_tracking_depth: ::std::os::raw::c_int,
    pub async_gen_firstiter: *mut PyObject,
    pub async_gen_finalizer: *mut PyObject,
    pub context: *mut PyObject,
    pub context_ver: u64,
    pub id: u64,
}
#[test]
fn bindgen_test_layout__ts() {
    assert_eq!(
        ::std::mem::size_of::<_ts>(),
        264usize,
        concat!("Size of: ", stringify!(_ts))
    );
    assert_eq!(
        ::std::mem::align_of::<_ts>(),
        8usize,
        concat!("Alignment of ", stringify!(_ts))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_ts>())).prev as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(_ts), "::", stringify!(prev))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_ts>())).next as *const _ as usize },
        8usize,
        concat!("Offset of field: ", stringify!(_ts), "::", stringify!(next))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_ts>())).interp as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_ts),
            "::",
            stringify!(interp)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_ts>())).frame as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_ts),
            "::",
            stringify!(frame)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_ts>())).recursion_depth as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_ts),
            "::",
            stringify!(recursion_depth)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_ts>())).overflowed as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(_ts),
            "::",
            stringify!(overflowed)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_ts>())).recursion_critical as *const _ as usize },
        37usize,
        concat!(
            "Offset of field: ",
            stringify!(_ts),
            "::",
            stringify!(recursion_critical)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_ts>())).stackcheck_counter as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_ts),
            "::",
            stringify!(stackcheck_counter)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_ts>())).tracing as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(_ts),
            "::",
            stringify!(tracing)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_ts>())).use_tracing as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_ts),
            "::",
            stringify!(use_tracing)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_ts>())).c_profilefunc as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_ts),
            "::",
            stringify!(c_profilefunc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_ts>())).c_tracefunc as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_ts),
            "::",
            stringify!(c_tracefunc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_ts>())).c_profileobj as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_ts),
            "::",
            stringify!(c_profileobj)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_ts>())).c_traceobj as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_ts),
            "::",
            stringify!(c_traceobj)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_ts>())).curexc_type as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_ts),
            "::",
            stringify!(curexc_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_ts>())).curexc_value as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_ts),
            "::",
            stringify!(curexc_value)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_ts>())).curexc_traceback as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_ts),
            "::",
            stringify!(curexc_traceback)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_ts>())).exc_state as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_ts),
            "::",
            stringify!(exc_state)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_ts>())).exc_info as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(_ts),
            "::",
            stringify!(exc_info)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_ts>())).dict as *const _ as usize },
        152usize,
        concat!("Offset of field: ", stringify!(_ts), "::", stringify!(dict))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_ts>())).gilstate_counter as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(_ts),
            "::",
            stringify!(gilstate_counter)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_ts>())).async_exc as *const _ as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(_ts),
            "::",
            stringify!(async_exc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_ts>())).thread_id as *const _ as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(_ts),
            "::",
            stringify!(thread_id)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_ts>())).trash_delete_nesting as *const _ as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(_ts),
            "::",
            stringify!(trash_delete_nesting)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_ts>())).trash_delete_later as *const _ as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(_ts),
            "::",
            stringify!(trash_delete_later)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_ts>())).on_delete as *const _ as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(_ts),
            "::",
            stringify!(on_delete)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_ts>())).on_delete_data as *const _ as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(_ts),
            "::",
            stringify!(on_delete_data)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_ts>())).coroutine_origin_tracking_depth as *const _ as usize
        },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(_ts),
            "::",
            stringify!(coroutine_origin_tracking_depth)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_ts>())).async_gen_firstiter as *const _ as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(_ts),
            "::",
            stringify!(async_gen_firstiter)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_ts>())).async_gen_finalizer as *const _ as usize },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(_ts),
            "::",
            stringify!(async_gen_finalizer)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_ts>())).context as *const _ as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(_ts),
            "::",
            stringify!(context)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_ts>())).context_ver as *const _ as usize },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(_ts),
            "::",
            stringify!(context_ver)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_ts>())).id as *const _ as usize },
        256usize,
        concat!("Offset of field: ", stringify!(_ts), "::", stringify!(id))
    );
}
pub type _PyFrameEvalFunction = ::std::option::Option<
    unsafe extern "C" fn(
        tstate: *mut PyThreadState,
        arg1: *mut PyFrameObject,
        arg2: ::std::os::raw::c_int,
    ) -> *mut PyObject,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _xid {
    pub data: *mut ::std::os::raw::c_void,
    pub obj: *mut PyObject,
    pub interp: i64,
    pub new_object: ::std::option::Option<unsafe extern "C" fn(arg1: *mut _xid) -> *mut PyObject>,
    pub free: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
}
#[test]
fn bindgen_test_layout__xid() {
    assert_eq!(
        ::std::mem::size_of::<_xid>(),
        40usize,
        concat!("Size of: ", stringify!(_xid))
    );
    assert_eq!(
        ::std::mem::align_of::<_xid>(),
        8usize,
        concat!("Alignment of ", stringify!(_xid))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_xid>())).data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_xid),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_xid>())).obj as *const _ as usize },
        8usize,
        concat!("Offset of field: ", stringify!(_xid), "::", stringify!(obj))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_xid>())).interp as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_xid),
            "::",
            stringify!(interp)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_xid>())).new_object as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_xid),
            "::",
            stringify!(new_object)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_xid>())).free as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_xid),
            "::",
            stringify!(free)
        )
    );
}
pub type _PyCrossInterpreterData = _xid;
pub type crossinterpdatafunc = ::std::option::Option<
    unsafe extern "C" fn(arg1: *mut PyObject, arg2: *mut _xid) -> ::std::os::raw::c_int,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PyGenObject {
    pub ob_base: PyObject,
    pub gi_frame: *mut PyFrameObject,
    pub gi_running: ::std::os::raw::c_char,
    pub gi_code: *mut PyObject,
    pub gi_weakreflist: *mut PyObject,
    pub gi_name: *mut PyObject,
    pub gi_qualname: *mut PyObject,
    pub gi_exc_state: _PyErr_StackItem,
}
#[test]
fn bindgen_test_layout_PyGenObject() {
    assert_eq!(
        ::std::mem::size_of::<PyGenObject>(),
        96usize,
        concat!("Size of: ", stringify!(PyGenObject))
    );
    assert_eq!(
        ::std::mem::align_of::<PyGenObject>(),
        8usize,
        concat!("Alignment of ", stringify!(PyGenObject))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyGenObject>())).ob_base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PyGenObject),
            "::",
            stringify!(ob_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyGenObject>())).gi_frame as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(PyGenObject),
            "::",
            stringify!(gi_frame)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyGenObject>())).gi_running as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(PyGenObject),
            "::",
            stringify!(gi_running)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyGenObject>())).gi_code as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(PyGenObject),
            "::",
            stringify!(gi_code)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyGenObject>())).gi_weakreflist as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(PyGenObject),
            "::",
            stringify!(gi_weakreflist)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyGenObject>())).gi_name as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(PyGenObject),
            "::",
            stringify!(gi_name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyGenObject>())).gi_qualname as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(PyGenObject),
            "::",
            stringify!(gi_qualname)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyGenObject>())).gi_exc_state as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(PyGenObject),
            "::",
            stringify!(gi_exc_state)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PyCoroObject {
    pub ob_base: PyObject,
    pub cr_frame: *mut PyFrameObject,
    pub cr_running: ::std::os::raw::c_char,
    pub cr_code: *mut PyObject,
    pub cr_weakreflist: *mut PyObject,
    pub cr_name: *mut PyObject,
    pub cr_qualname: *mut PyObject,
    pub cr_exc_state: _PyErr_StackItem,
    pub cr_origin: *mut PyObject,
}
#[test]
fn bindgen_test_layout_PyCoroObject() {
    assert_eq!(
        ::std::mem::size_of::<PyCoroObject>(),
        104usize,
        concat!("Size of: ", stringify!(PyCoroObject))
    );
    assert_eq!(
        ::std::mem::align_of::<PyCoroObject>(),
        8usize,
        concat!("Alignment of ", stringify!(PyCoroObject))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyCoroObject>())).ob_base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PyCoroObject),
            "::",
            stringify!(ob_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyCoroObject>())).cr_frame as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(PyCoroObject),
            "::",
            stringify!(cr_frame)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyCoroObject>())).cr_running as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(PyCoroObject),
            "::",
            stringify!(cr_running)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyCoroObject>())).cr_code as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(PyCoroObject),
            "::",
            stringify!(cr_code)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyCoroObject>())).cr_weakreflist as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(PyCoroObject),
            "::",
            stringify!(cr_weakreflist)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyCoroObject>())).cr_name as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(PyCoroObject),
            "::",
            stringify!(cr_name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyCoroObject>())).cr_qualname as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(PyCoroObject),
            "::",
            stringify!(cr_qualname)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyCoroObject>())).cr_exc_state as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(PyCoroObject),
            "::",
            stringify!(cr_exc_state)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyCoroObject>())).cr_origin as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(PyCoroObject),
            "::",
            stringify!(cr_origin)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PyAsyncGenObject {
    pub ob_base: PyObject,
    pub ag_frame: *mut PyFrameObject,
    pub ag_running: ::std::os::raw::c_char,
    pub ag_code: *mut PyObject,
    pub ag_weakreflist: *mut PyObject,
    pub ag_name: *mut PyObject,
    pub ag_qualname: *mut PyObject,
    pub ag_exc_state: _PyErr_StackItem,
    pub ag_finalizer: *mut PyObject,
    pub ag_hooks_inited: ::std::os::raw::c_int,
    pub ag_closed: ::std::os::raw::c_int,
    pub ag_running_async: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_PyAsyncGenObject() {
    assert_eq!(
        ::std::mem::size_of::<PyAsyncGenObject>(),
        120usize,
        concat!("Size of: ", stringify!(PyAsyncGenObject))
    );
    assert_eq!(
        ::std::mem::align_of::<PyAsyncGenObject>(),
        8usize,
        concat!("Alignment of ", stringify!(PyAsyncGenObject))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyAsyncGenObject>())).ob_base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PyAsyncGenObject),
            "::",
            stringify!(ob_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyAsyncGenObject>())).ag_frame as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(PyAsyncGenObject),
            "::",
            stringify!(ag_frame)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyAsyncGenObject>())).ag_running as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(PyAsyncGenObject),
            "::",
            stringify!(ag_running)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyAsyncGenObject>())).ag_code as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(PyAsyncGenObject),
            "::",
            stringify!(ag_code)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyAsyncGenObject>())).ag_weakreflist as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(PyAsyncGenObject),
            "::",
            stringify!(ag_weakreflist)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyAsyncGenObject>())).ag_name as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(PyAsyncGenObject),
            "::",
            stringify!(ag_name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyAsyncGenObject>())).ag_qualname as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(PyAsyncGenObject),
            "::",
            stringify!(ag_qualname)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyAsyncGenObject>())).ag_exc_state as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(PyAsyncGenObject),
            "::",
            stringify!(ag_exc_state)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyAsyncGenObject>())).ag_finalizer as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(PyAsyncGenObject),
            "::",
            stringify!(ag_finalizer)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<PyAsyncGenObject>())).ag_hooks_inited as *const _ as usize
        },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(PyAsyncGenObject),
            "::",
            stringify!(ag_hooks_inited)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyAsyncGenObject>())).ag_closed as *const _ as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(PyAsyncGenObject),
            "::",
            stringify!(ag_closed)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<PyAsyncGenObject>())).ag_running_async as *const _ as usize
        },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(PyAsyncGenObject),
            "::",
            stringify!(ag_running_async)
        )
    );
}
pub type getter = ::std::option::Option<
    unsafe extern "C" fn(arg1: *mut PyObject, arg2: *mut ::std::os::raw::c_void) -> *mut PyObject,
>;
pub type setter = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut PyObject,
        arg2: *mut PyObject,
        arg3: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PyGetSetDef {
    pub name: *const ::std::os::raw::c_char,
    pub get: getter,
    pub set: setter,
    pub doc: *const ::std::os::raw::c_char,
    pub closure: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_PyGetSetDef() {
    assert_eq!(
        ::std::mem::size_of::<PyGetSetDef>(),
        40usize,
        concat!("Size of: ", stringify!(PyGetSetDef))
    );
    assert_eq!(
        ::std::mem::align_of::<PyGetSetDef>(),
        8usize,
        concat!("Alignment of ", stringify!(PyGetSetDef))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyGetSetDef>())).name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PyGetSetDef),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyGetSetDef>())).get as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(PyGetSetDef),
            "::",
            stringify!(get)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyGetSetDef>())).set as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(PyGetSetDef),
            "::",
            stringify!(set)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyGetSetDef>())).doc as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(PyGetSetDef),
            "::",
            stringify!(doc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyGetSetDef>())).closure as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(PyGetSetDef),
            "::",
            stringify!(closure)
        )
    );
}
pub type wrapperfunc = ::std::option::Option<
    unsafe extern "C" fn(
        self_: *mut PyObject,
        args: *mut PyObject,
        wrapped: *mut ::std::os::raw::c_void,
    ) -> *mut PyObject,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wrapperbase {
    pub name: *const ::std::os::raw::c_char,
    pub offset: ::std::os::raw::c_int,
    pub function: *mut ::std::os::raw::c_void,
    pub wrapper: wrapperfunc,
    pub doc: *const ::std::os::raw::c_char,
    pub flags: ::std::os::raw::c_int,
    pub name_strobj: *mut PyObject,
}
#[test]
fn bindgen_test_layout_wrapperbase() {
    assert_eq!(
        ::std::mem::size_of::<wrapperbase>(),
        56usize,
        concat!("Size of: ", stringify!(wrapperbase))
    );
    assert_eq!(
        ::std::mem::align_of::<wrapperbase>(),
        8usize,
        concat!("Alignment of ", stringify!(wrapperbase))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wrapperbase>())).name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wrapperbase),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wrapperbase>())).offset as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(wrapperbase),
            "::",
            stringify!(offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wrapperbase>())).function as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(wrapperbase),
            "::",
            stringify!(function)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wrapperbase>())).wrapper as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(wrapperbase),
            "::",
            stringify!(wrapper)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wrapperbase>())).doc as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(wrapperbase),
            "::",
            stringify!(doc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wrapperbase>())).flags as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(wrapperbase),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wrapperbase>())).name_strobj as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(wrapperbase),
            "::",
            stringify!(name_strobj)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PyDescrObject {
    pub ob_base: PyObject,
    pub d_type: *mut PyTypeObject,
    pub d_name: *mut PyObject,
    pub d_qualname: *mut PyObject,
}
#[test]
fn bindgen_test_layout_PyDescrObject() {
    assert_eq!(
        ::std::mem::size_of::<PyDescrObject>(),
        40usize,
        concat!("Size of: ", stringify!(PyDescrObject))
    );
    assert_eq!(
        ::std::mem::align_of::<PyDescrObject>(),
        8usize,
        concat!("Alignment of ", stringify!(PyDescrObject))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyDescrObject>())).ob_base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PyDescrObject),
            "::",
            stringify!(ob_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyDescrObject>())).d_type as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(PyDescrObject),
            "::",
            stringify!(d_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyDescrObject>())).d_name as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(PyDescrObject),
            "::",
            stringify!(d_name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyDescrObject>())).d_qualname as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(PyDescrObject),
            "::",
            stringify!(d_qualname)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PyMethodDescrObject {
    pub d_common: PyDescrObject,
    pub d_method: *mut PyMethodDef,
    pub vectorcall: vectorcallfunc,
}
#[test]
fn bindgen_test_layout_PyMethodDescrObject() {
    assert_eq!(
        ::std::mem::size_of::<PyMethodDescrObject>(),
        56usize,
        concat!("Size of: ", stringify!(PyMethodDescrObject))
    );
    assert_eq!(
        ::std::mem::align_of::<PyMethodDescrObject>(),
        8usize,
        concat!("Alignment of ", stringify!(PyMethodDescrObject))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyMethodDescrObject>())).d_common as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PyMethodDescrObject),
            "::",
            stringify!(d_common)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyMethodDescrObject>())).d_method as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(PyMethodDescrObject),
            "::",
            stringify!(d_method)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyMethodDescrObject>())).vectorcall as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(PyMethodDescrObject),
            "::",
            stringify!(vectorcall)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PyMemberDescrObject {
    pub d_common: PyDescrObject,
    pub d_member: *mut PyMemberDef,
}
#[test]
fn bindgen_test_layout_PyMemberDescrObject() {
    assert_eq!(
        ::std::mem::size_of::<PyMemberDescrObject>(),
        48usize,
        concat!("Size of: ", stringify!(PyMemberDescrObject))
    );
    assert_eq!(
        ::std::mem::align_of::<PyMemberDescrObject>(),
        8usize,
        concat!("Alignment of ", stringify!(PyMemberDescrObject))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyMemberDescrObject>())).d_common as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PyMemberDescrObject),
            "::",
            stringify!(d_common)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyMemberDescrObject>())).d_member as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(PyMemberDescrObject),
            "::",
            stringify!(d_member)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PyGetSetDescrObject {
    pub d_common: PyDescrObject,
    pub d_getset: *mut PyGetSetDef,
}
#[test]
fn bindgen_test_layout_PyGetSetDescrObject() {
    assert_eq!(
        ::std::mem::size_of::<PyGetSetDescrObject>(),
        48usize,
        concat!("Size of: ", stringify!(PyGetSetDescrObject))
    );
    assert_eq!(
        ::std::mem::align_of::<PyGetSetDescrObject>(),
        8usize,
        concat!("Alignment of ", stringify!(PyGetSetDescrObject))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyGetSetDescrObject>())).d_common as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PyGetSetDescrObject),
            "::",
            stringify!(d_common)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyGetSetDescrObject>())).d_getset as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(PyGetSetDescrObject),
            "::",
            stringify!(d_getset)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PyWrapperDescrObject {
    pub d_common: PyDescrObject,
    pub d_base: *mut wrapperbase,
    pub d_wrapped: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_PyWrapperDescrObject() {
    assert_eq!(
        ::std::mem::size_of::<PyWrapperDescrObject>(),
        56usize,
        concat!("Size of: ", stringify!(PyWrapperDescrObject))
    );
    assert_eq!(
        ::std::mem::align_of::<PyWrapperDescrObject>(),
        8usize,
        concat!("Alignment of ", stringify!(PyWrapperDescrObject))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyWrapperDescrObject>())).d_common as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PyWrapperDescrObject),
            "::",
            stringify!(d_common)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyWrapperDescrObject>())).d_base as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(PyWrapperDescrObject),
            "::",
            stringify!(d_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyWrapperDescrObject>())).d_wrapped as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(PyWrapperDescrObject),
            "::",
            stringify!(d_wrapped)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PyMemberDef {
    _unused: [u8; 0],
}
pub type PyWeakReference = _PyWeakReference;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _PyWeakReference {
    pub ob_base: PyObject,
    pub wr_object: *mut PyObject,
    pub wr_callback: *mut PyObject,
    pub hash: Py_hash_t,
    pub wr_prev: *mut PyWeakReference,
    pub wr_next: *mut PyWeakReference,
}
#[test]
fn bindgen_test_layout__PyWeakReference() {
    assert_eq!(
        ::std::mem::size_of::<_PyWeakReference>(),
        56usize,
        concat!("Size of: ", stringify!(_PyWeakReference))
    );
    assert_eq!(
        ::std::mem::align_of::<_PyWeakReference>(),
        8usize,
        concat!("Alignment of ", stringify!(_PyWeakReference))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_PyWeakReference>())).ob_base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_PyWeakReference),
            "::",
            stringify!(ob_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_PyWeakReference>())).wr_object as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_PyWeakReference),
            "::",
            stringify!(wr_object)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_PyWeakReference>())).wr_callback as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_PyWeakReference),
            "::",
            stringify!(wr_callback)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_PyWeakReference>())).hash as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_PyWeakReference),
            "::",
            stringify!(hash)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_PyWeakReference>())).wr_prev as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_PyWeakReference),
            "::",
            stringify!(wr_prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_PyWeakReference>())).wr_next as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_PyWeakReference),
            "::",
            stringify!(wr_next)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PyStructSequence_Field {
    pub name: *const ::std::os::raw::c_char,
    pub doc: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_PyStructSequence_Field() {
    assert_eq!(
        ::std::mem::size_of::<PyStructSequence_Field>(),
        16usize,
        concat!("Size of: ", stringify!(PyStructSequence_Field))
    );
    assert_eq!(
        ::std::mem::align_of::<PyStructSequence_Field>(),
        8usize,
        concat!("Alignment of ", stringify!(PyStructSequence_Field))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyStructSequence_Field>())).name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PyStructSequence_Field),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyStructSequence_Field>())).doc as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(PyStructSequence_Field),
            "::",
            stringify!(doc)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PyStructSequence_Desc {
    pub name: *const ::std::os::raw::c_char,
    pub doc: *const ::std::os::raw::c_char,
    pub fields: *mut PyStructSequence_Field,
    pub n_in_sequence: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_PyStructSequence_Desc() {
    assert_eq!(
        ::std::mem::size_of::<PyStructSequence_Desc>(),
        32usize,
        concat!("Size of: ", stringify!(PyStructSequence_Desc))
    );
    assert_eq!(
        ::std::mem::align_of::<PyStructSequence_Desc>(),
        8usize,
        concat!("Alignment of ", stringify!(PyStructSequence_Desc))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyStructSequence_Desc>())).name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PyStructSequence_Desc),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyStructSequence_Desc>())).doc as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(PyStructSequence_Desc),
            "::",
            stringify!(doc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyStructSequence_Desc>())).fields as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(PyStructSequence_Desc),
            "::",
            stringify!(fields)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<PyStructSequence_Desc>())).n_in_sequence as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(PyStructSequence_Desc),
            "::",
            stringify!(n_in_sequence)
        )
    );
}
pub type PyStructSequence = PyTupleObject;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PyBaseExceptionObject {
    pub ob_base: PyObject,
    pub dict: *mut PyObject,
    pub args: *mut PyObject,
    pub traceback: *mut PyObject,
    pub context: *mut PyObject,
    pub cause: *mut PyObject,
    pub suppress_context: ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_PyBaseExceptionObject() {
    assert_eq!(
        ::std::mem::size_of::<PyBaseExceptionObject>(),
        64usize,
        concat!("Size of: ", stringify!(PyBaseExceptionObject))
    );
    assert_eq!(
        ::std::mem::align_of::<PyBaseExceptionObject>(),
        8usize,
        concat!("Alignment of ", stringify!(PyBaseExceptionObject))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyBaseExceptionObject>())).ob_base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PyBaseExceptionObject),
            "::",
            stringify!(ob_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyBaseExceptionObject>())).dict as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(PyBaseExceptionObject),
            "::",
            stringify!(dict)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyBaseExceptionObject>())).args as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(PyBaseExceptionObject),
            "::",
            stringify!(args)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyBaseExceptionObject>())).traceback as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(PyBaseExceptionObject),
            "::",
            stringify!(traceback)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyBaseExceptionObject>())).context as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(PyBaseExceptionObject),
            "::",
            stringify!(context)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyBaseExceptionObject>())).cause as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(PyBaseExceptionObject),
            "::",
            stringify!(cause)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<PyBaseExceptionObject>())).suppress_context as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(PyBaseExceptionObject),
            "::",
            stringify!(suppress_context)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PySyntaxErrorObject {
    pub ob_base: PyObject,
    pub dict: *mut PyObject,
    pub args: *mut PyObject,
    pub traceback: *mut PyObject,
    pub context: *mut PyObject,
    pub cause: *mut PyObject,
    pub suppress_context: ::std::os::raw::c_char,
    pub msg: *mut PyObject,
    pub filename: *mut PyObject,
    pub lineno: *mut PyObject,
    pub offset: *mut PyObject,
    pub text: *mut PyObject,
    pub print_file_and_line: *mut PyObject,
}
#[test]
fn bindgen_test_layout_PySyntaxErrorObject() {
    assert_eq!(
        ::std::mem::size_of::<PySyntaxErrorObject>(),
        112usize,
        concat!("Size of: ", stringify!(PySyntaxErrorObject))
    );
    assert_eq!(
        ::std::mem::align_of::<PySyntaxErrorObject>(),
        8usize,
        concat!("Alignment of ", stringify!(PySyntaxErrorObject))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PySyntaxErrorObject>())).ob_base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PySyntaxErrorObject),
            "::",
            stringify!(ob_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PySyntaxErrorObject>())).dict as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(PySyntaxErrorObject),
            "::",
            stringify!(dict)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PySyntaxErrorObject>())).args as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(PySyntaxErrorObject),
            "::",
            stringify!(args)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PySyntaxErrorObject>())).traceback as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(PySyntaxErrorObject),
            "::",
            stringify!(traceback)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PySyntaxErrorObject>())).context as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(PySyntaxErrorObject),
            "::",
            stringify!(context)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PySyntaxErrorObject>())).cause as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(PySyntaxErrorObject),
            "::",
            stringify!(cause)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<PySyntaxErrorObject>())).suppress_context as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(PySyntaxErrorObject),
            "::",
            stringify!(suppress_context)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PySyntaxErrorObject>())).msg as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(PySyntaxErrorObject),
            "::",
            stringify!(msg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PySyntaxErrorObject>())).filename as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(PySyntaxErrorObject),
            "::",
            stringify!(filename)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PySyntaxErrorObject>())).lineno as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(PySyntaxErrorObject),
            "::",
            stringify!(lineno)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PySyntaxErrorObject>())).offset as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(PySyntaxErrorObject),
            "::",
            stringify!(offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PySyntaxErrorObject>())).text as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(PySyntaxErrorObject),
            "::",
            stringify!(text)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<PySyntaxErrorObject>())).print_file_and_line as *const _ as usize
        },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(PySyntaxErrorObject),
            "::",
            stringify!(print_file_and_line)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PyImportErrorObject {
    pub ob_base: PyObject,
    pub dict: *mut PyObject,
    pub args: *mut PyObject,
    pub traceback: *mut PyObject,
    pub context: *mut PyObject,
    pub cause: *mut PyObject,
    pub suppress_context: ::std::os::raw::c_char,
    pub msg: *mut PyObject,
    pub name: *mut PyObject,
    pub path: *mut PyObject,
}
#[test]
fn bindgen_test_layout_PyImportErrorObject() {
    assert_eq!(
        ::std::mem::size_of::<PyImportErrorObject>(),
        88usize,
        concat!("Size of: ", stringify!(PyImportErrorObject))
    );
    assert_eq!(
        ::std::mem::align_of::<PyImportErrorObject>(),
        8usize,
        concat!("Alignment of ", stringify!(PyImportErrorObject))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyImportErrorObject>())).ob_base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PyImportErrorObject),
            "::",
            stringify!(ob_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyImportErrorObject>())).dict as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(PyImportErrorObject),
            "::",
            stringify!(dict)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyImportErrorObject>())).args as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(PyImportErrorObject),
            "::",
            stringify!(args)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyImportErrorObject>())).traceback as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(PyImportErrorObject),
            "::",
            stringify!(traceback)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyImportErrorObject>())).context as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(PyImportErrorObject),
            "::",
            stringify!(context)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyImportErrorObject>())).cause as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(PyImportErrorObject),
            "::",
            stringify!(cause)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<PyImportErrorObject>())).suppress_context as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(PyImportErrorObject),
            "::",
            stringify!(suppress_context)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyImportErrorObject>())).msg as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(PyImportErrorObject),
            "::",
            stringify!(msg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyImportErrorObject>())).name as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(PyImportErrorObject),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyImportErrorObject>())).path as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(PyImportErrorObject),
            "::",
            stringify!(path)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PyUnicodeErrorObject {
    pub ob_base: PyObject,
    pub dict: *mut PyObject,
    pub args: *mut PyObject,
    pub traceback: *mut PyObject,
    pub context: *mut PyObject,
    pub cause: *mut PyObject,
    pub suppress_context: ::std::os::raw::c_char,
    pub encoding: *mut PyObject,
    pub object: *mut PyObject,
    pub start: Py_ssize_t,
    pub end: Py_ssize_t,
    pub reason: *mut PyObject,
}
#[test]
fn bindgen_test_layout_PyUnicodeErrorObject() {
    assert_eq!(
        ::std::mem::size_of::<PyUnicodeErrorObject>(),
        104usize,
        concat!("Size of: ", stringify!(PyUnicodeErrorObject))
    );
    assert_eq!(
        ::std::mem::align_of::<PyUnicodeErrorObject>(),
        8usize,
        concat!("Alignment of ", stringify!(PyUnicodeErrorObject))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyUnicodeErrorObject>())).ob_base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PyUnicodeErrorObject),
            "::",
            stringify!(ob_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyUnicodeErrorObject>())).dict as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(PyUnicodeErrorObject),
            "::",
            stringify!(dict)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyUnicodeErrorObject>())).args as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(PyUnicodeErrorObject),
            "::",
            stringify!(args)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyUnicodeErrorObject>())).traceback as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(PyUnicodeErrorObject),
            "::",
            stringify!(traceback)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyUnicodeErrorObject>())).context as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(PyUnicodeErrorObject),
            "::",
            stringify!(context)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyUnicodeErrorObject>())).cause as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(PyUnicodeErrorObject),
            "::",
            stringify!(cause)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<PyUnicodeErrorObject>())).suppress_context as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(PyUnicodeErrorObject),
            "::",
            stringify!(suppress_context)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyUnicodeErrorObject>())).encoding as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(PyUnicodeErrorObject),
            "::",
            stringify!(encoding)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyUnicodeErrorObject>())).object as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(PyUnicodeErrorObject),
            "::",
            stringify!(object)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyUnicodeErrorObject>())).start as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(PyUnicodeErrorObject),
            "::",
            stringify!(start)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyUnicodeErrorObject>())).end as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(PyUnicodeErrorObject),
            "::",
            stringify!(end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyUnicodeErrorObject>())).reason as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(PyUnicodeErrorObject),
            "::",
            stringify!(reason)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PySystemExitObject {
    pub ob_base: PyObject,
    pub dict: *mut PyObject,
    pub args: *mut PyObject,
    pub traceback: *mut PyObject,
    pub context: *mut PyObject,
    pub cause: *mut PyObject,
    pub suppress_context: ::std::os::raw::c_char,
    pub code: *mut PyObject,
}
#[test]
fn bindgen_test_layout_PySystemExitObject() {
    assert_eq!(
        ::std::mem::size_of::<PySystemExitObject>(),
        72usize,
        concat!("Size of: ", stringify!(PySystemExitObject))
    );
    assert_eq!(
        ::std::mem::align_of::<PySystemExitObject>(),
        8usize,
        concat!("Alignment of ", stringify!(PySystemExitObject))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PySystemExitObject>())).ob_base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PySystemExitObject),
            "::",
            stringify!(ob_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PySystemExitObject>())).dict as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(PySystemExitObject),
            "::",
            stringify!(dict)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PySystemExitObject>())).args as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(PySystemExitObject),
            "::",
            stringify!(args)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PySystemExitObject>())).traceback as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(PySystemExitObject),
            "::",
            stringify!(traceback)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PySystemExitObject>())).context as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(PySystemExitObject),
            "::",
            stringify!(context)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PySystemExitObject>())).cause as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(PySystemExitObject),
            "::",
            stringify!(cause)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<PySystemExitObject>())).suppress_context as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(PySystemExitObject),
            "::",
            stringify!(suppress_context)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PySystemExitObject>())).code as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(PySystemExitObject),
            "::",
            stringify!(code)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PyOSErrorObject {
    pub ob_base: PyObject,
    pub dict: *mut PyObject,
    pub args: *mut PyObject,
    pub traceback: *mut PyObject,
    pub context: *mut PyObject,
    pub cause: *mut PyObject,
    pub suppress_context: ::std::os::raw::c_char,
    pub myerrno: *mut PyObject,
    pub strerror: *mut PyObject,
    pub filename: *mut PyObject,
    pub filename2: *mut PyObject,
    pub written: Py_ssize_t,
}
#[test]
fn bindgen_test_layout_PyOSErrorObject() {
    assert_eq!(
        ::std::mem::size_of::<PyOSErrorObject>(),
        104usize,
        concat!("Size of: ", stringify!(PyOSErrorObject))
    );
    assert_eq!(
        ::std::mem::align_of::<PyOSErrorObject>(),
        8usize,
        concat!("Alignment of ", stringify!(PyOSErrorObject))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyOSErrorObject>())).ob_base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PyOSErrorObject),
            "::",
            stringify!(ob_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyOSErrorObject>())).dict as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(PyOSErrorObject),
            "::",
            stringify!(dict)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyOSErrorObject>())).args as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(PyOSErrorObject),
            "::",
            stringify!(args)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyOSErrorObject>())).traceback as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(PyOSErrorObject),
            "::",
            stringify!(traceback)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyOSErrorObject>())).context as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(PyOSErrorObject),
            "::",
            stringify!(context)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyOSErrorObject>())).cause as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(PyOSErrorObject),
            "::",
            stringify!(cause)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<PyOSErrorObject>())).suppress_context as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(PyOSErrorObject),
            "::",
            stringify!(suppress_context)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyOSErrorObject>())).myerrno as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(PyOSErrorObject),
            "::",
            stringify!(myerrno)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyOSErrorObject>())).strerror as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(PyOSErrorObject),
            "::",
            stringify!(strerror)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyOSErrorObject>())).filename as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(PyOSErrorObject),
            "::",
            stringify!(filename)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyOSErrorObject>())).filename2 as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(PyOSErrorObject),
            "::",
            stringify!(filename2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyOSErrorObject>())).written as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(PyOSErrorObject),
            "::",
            stringify!(written)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PyStopIterationObject {
    pub ob_base: PyObject,
    pub dict: *mut PyObject,
    pub args: *mut PyObject,
    pub traceback: *mut PyObject,
    pub context: *mut PyObject,
    pub cause: *mut PyObject,
    pub suppress_context: ::std::os::raw::c_char,
    pub value: *mut PyObject,
}
#[test]
fn bindgen_test_layout_PyStopIterationObject() {
    assert_eq!(
        ::std::mem::size_of::<PyStopIterationObject>(),
        72usize,
        concat!("Size of: ", stringify!(PyStopIterationObject))
    );
    assert_eq!(
        ::std::mem::align_of::<PyStopIterationObject>(),
        8usize,
        concat!("Alignment of ", stringify!(PyStopIterationObject))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyStopIterationObject>())).ob_base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PyStopIterationObject),
            "::",
            stringify!(ob_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyStopIterationObject>())).dict as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(PyStopIterationObject),
            "::",
            stringify!(dict)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyStopIterationObject>())).args as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(PyStopIterationObject),
            "::",
            stringify!(args)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyStopIterationObject>())).traceback as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(PyStopIterationObject),
            "::",
            stringify!(traceback)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyStopIterationObject>())).context as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(PyStopIterationObject),
            "::",
            stringify!(context)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyStopIterationObject>())).cause as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(PyStopIterationObject),
            "::",
            stringify!(cause)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<PyStopIterationObject>())).suppress_context as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(PyStopIterationObject),
            "::",
            stringify!(suppress_context)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyStopIterationObject>())).value as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(PyStopIterationObject),
            "::",
            stringify!(value)
        )
    );
}
pub type PyEnvironmentErrorObject = PyOSErrorObject;
pub type PyThread_type_lock = *mut ::std::os::raw::c_void;
pub const PyLockStatus_PY_LOCK_FAILURE: PyLockStatus = 0;
pub const PyLockStatus_PY_LOCK_ACQUIRED: PyLockStatus = 1;
pub const PyLockStatus_PY_LOCK_INTR: PyLockStatus = 2;
pub type PyLockStatus = ::std::os::raw::c_uint;
pub type Py_tss_t = _Py_tss_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _Py_tss_t {
    pub _is_initialized: ::std::os::raw::c_int,
    pub _key: pthread_key_t,
}
#[test]
fn bindgen_test_layout__Py_tss_t() {
    assert_eq!(
        ::std::mem::size_of::<_Py_tss_t>(),
        8usize,
        concat!("Size of: ", stringify!(_Py_tss_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_Py_tss_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_Py_tss_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_Py_tss_t>()))._is_initialized as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_Py_tss_t),
            "::",
            stringify!(_is_initialized)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_Py_tss_t>()))._key as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_Py_tss_t),
            "::",
            stringify!(_key)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _pycontextobject {
    _unused: [u8; 0],
}
pub type PyContext = _pycontextobject;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _pycontextvarobject {
    _unused: [u8; 0],
}
pub type PyContextVar = _pycontextvarobject;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _pycontexttokenobject {
    _unused: [u8; 0],
}
pub type PyContextToken = _pycontexttokenobject;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _arena {
    _unused: [u8; 0],
}
pub type PyArena = _arena;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _PyArg_Parser {
    pub format: *const ::std::os::raw::c_char,
    pub keywords: *const *const ::std::os::raw::c_char,
    pub fname: *const ::std::os::raw::c_char,
    pub custom_msg: *const ::std::os::raw::c_char,
    pub pos: ::std::os::raw::c_int,
    pub min: ::std::os::raw::c_int,
    pub max: ::std::os::raw::c_int,
    pub kwtuple: *mut PyObject,
    pub next: *mut _PyArg_Parser,
}
#[test]
fn bindgen_test_layout__PyArg_Parser() {
    assert_eq!(
        ::std::mem::size_of::<_PyArg_Parser>(),
        64usize,
        concat!("Size of: ", stringify!(_PyArg_Parser))
    );
    assert_eq!(
        ::std::mem::align_of::<_PyArg_Parser>(),
        8usize,
        concat!("Alignment of ", stringify!(_PyArg_Parser))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_PyArg_Parser>())).format as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_PyArg_Parser),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_PyArg_Parser>())).keywords as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_PyArg_Parser),
            "::",
            stringify!(keywords)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_PyArg_Parser>())).fname as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_PyArg_Parser),
            "::",
            stringify!(fname)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_PyArg_Parser>())).custom_msg as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_PyArg_Parser),
            "::",
            stringify!(custom_msg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_PyArg_Parser>())).pos as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_PyArg_Parser),
            "::",
            stringify!(pos)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_PyArg_Parser>())).min as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(_PyArg_Parser),
            "::",
            stringify!(min)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_PyArg_Parser>())).max as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_PyArg_Parser),
            "::",
            stringify!(max)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_PyArg_Parser>())).kwtuple as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_PyArg_Parser),
            "::",
            stringify!(kwtuple)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_PyArg_Parser>())).next as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_PyArg_Parser),
            "::",
            stringify!(next)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _node {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PyCompilerFlags {
    pub cf_flags: ::std::os::raw::c_int,
    pub cf_feature_version: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_PyCompilerFlags() {
    assert_eq!(
        ::std::mem::size_of::<PyCompilerFlags>(),
        8usize,
        concat!("Size of: ", stringify!(PyCompilerFlags))
    );
    assert_eq!(
        ::std::mem::align_of::<PyCompilerFlags>(),
        4usize,
        concat!("Alignment of ", stringify!(PyCompilerFlags))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyCompilerFlags>())).cf_flags as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PyCompilerFlags),
            "::",
            stringify!(cf_flags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<PyCompilerFlags>())).cf_feature_version as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(PyCompilerFlags),
            "::",
            stringify!(cf_feature_version)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PyFutureFeatures {
    pub ff_features: ::std::os::raw::c_int,
    pub ff_lineno: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_PyFutureFeatures() {
    assert_eq!(
        ::std::mem::size_of::<PyFutureFeatures>(),
        8usize,
        concat!("Size of: ", stringify!(PyFutureFeatures))
    );
    assert_eq!(
        ::std::mem::align_of::<PyFutureFeatures>(),
        4usize,
        concat!("Alignment of ", stringify!(PyFutureFeatures))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyFutureFeatures>())).ff_features as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PyFutureFeatures),
            "::",
            stringify!(ff_features)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PyFutureFeatures>())).ff_lineno as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(PyFutureFeatures),
            "::",
            stringify!(ff_lineno)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _mod {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _PyASTOptimizeState {
    pub optimize: ::std::os::raw::c_int,
    pub ff_features: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout__PyASTOptimizeState() {
    assert_eq!(
        ::std::mem::size_of::<_PyASTOptimizeState>(),
        8usize,
        concat!("Size of: ", stringify!(_PyASTOptimizeState))
    );
    assert_eq!(
        ::std::mem::align_of::<_PyASTOptimizeState>(),
        4usize,
        concat!("Alignment of ", stringify!(_PyASTOptimizeState))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_PyASTOptimizeState>())).optimize as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_PyASTOptimizeState),
            "::",
            stringify!(optimize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_PyASTOptimizeState>())).ff_features as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_PyASTOptimizeState),
            "::",
            stringify!(ff_features)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct symtable {
    _unused: [u8; 0],
}
pub type PyOS_sighandler_t =
    ::std::option::Option<unsafe extern "C" fn(arg1: ::std::os::raw::c_int)>;
pub type Py_AuditHookFunction = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut PyObject,
        arg3: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _inittab {
    pub name: *const ::std::os::raw::c_char,
    pub initfunc: ::std::option::Option<unsafe extern "C" fn() -> *mut PyObject>,
}
#[test]
fn bindgen_test_layout__inittab() {
    assert_eq!(
        ::std::mem::size_of::<_inittab>(),
        16usize,
        concat!("Size of: ", stringify!(_inittab))
    );
    assert_eq!(
        ::std::mem::align_of::<_inittab>(),
        8usize,
        concat!("Alignment of ", stringify!(_inittab))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_inittab>())).name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_inittab),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_inittab>())).initfunc as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_inittab),
            "::",
            stringify!(initfunc)
        )
    );
}
pub const _Py_error_handler__Py_ERROR_UNKNOWN: _Py_error_handler = 0;
pub const _Py_error_handler__Py_ERROR_STRICT: _Py_error_handler = 1;
pub const _Py_error_handler__Py_ERROR_SURROGATEESCAPE: _Py_error_handler = 2;
pub const _Py_error_handler__Py_ERROR_REPLACE: _Py_error_handler = 3;
pub const _Py_error_handler__Py_ERROR_IGNORE: _Py_error_handler = 4;
pub const _Py_error_handler__Py_ERROR_BACKSLASHREPLACE: _Py_error_handler = 5;
pub const _Py_error_handler__Py_ERROR_SURROGATEPASS: _Py_error_handler = 6;
pub const _Py_error_handler__Py_ERROR_XMLCHARREFREPLACE: _Py_error_handler = 7;
pub const _Py_error_handler__Py_ERROR_OTHER: _Py_error_handler = 8;
pub type _Py_error_handler = ::std::os::raw::c_uint;
pub type __builtin_va_list = [__va_list_tag; 1usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __va_list_tag {
    pub gp_offset: ::std::os::raw::c_uint,
    pub fp_offset: ::std::os::raw::c_uint,
    pub overflow_arg_area: *mut ::std::os::raw::c_void,
    pub reg_save_area: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout___va_list_tag() {
    assert_eq!(
        ::std::mem::size_of::<__va_list_tag>(),
        24usize,
        concat!("Size of: ", stringify!(__va_list_tag))
    );
    assert_eq!(
        ::std::mem::align_of::<__va_list_tag>(),
        8usize,
        concat!("Alignment of ", stringify!(__va_list_tag))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__va_list_tag>())).gp_offset as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__va_list_tag),
            "::",
            stringify!(gp_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__va_list_tag>())).fp_offset as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__va_list_tag),
            "::",
            stringify!(fp_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__va_list_tag>())).overflow_arg_area as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__va_list_tag),
            "::",
            stringify!(overflow_arg_area)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__va_list_tag>())).reg_save_area as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__va_list_tag),
            "::",
            stringify!(reg_save_area)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _dictkeysobject {
    pub _address: u8,
}
extern crate libloading;
pub struct PythonLib {
    __library: ::libloading::Library,
    pub _Py_get_387controlword:
        Result<unsafe extern "C" fn() -> ::std::os::raw::c_ushort, ::libloading::Error>,
    pub _Py_set_387controlword:
        Result<unsafe extern "C" fn(arg1: ::std::os::raw::c_ushort), ::libloading::Error>,
    pub _Py_bit_length: Result<
        unsafe extern "C" fn(d: ::std::os::raw::c_ulong) -> ::std::os::raw::c_uint,
        ::libloading::Error,
    >,
    pub PyType_FromSpec:
        Result<unsafe extern "C" fn(arg1: *mut PyType_Spec) -> *mut PyObject, ::libloading::Error>,
    pub PyType_FromSpecWithBases: Result<
        unsafe extern "C" fn(arg1: *mut PyType_Spec, arg2: *mut PyObject) -> *mut PyObject,
        ::libloading::Error,
